import os


COLOR_CODE = {
        "BLUE": "\033[34m",
        "RESET": "\033[0m",
    }
os.system("cls")
print(f'''{COLOR_CODE["BLUE"]} 
                                                                                 
                                                                                 
                                                                                     
                                                                                     
───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
─████████████───██████████████─██████████████─██████████████─██████████████───██████████████─██████████████─██████████████─
─██░░░░░░░░████─██░░░░░░░░░░██─██░░░░░░░░░░██─██░░░░░░░░░░██─██░░░░░░░░░░██───██░░░░░░░░░░██─██░░░░░░░░░░██─██░░░░░░░░░░██─
─██░░████░░░░██─██░░██████░░██─██████░░██████─██░░██████░░██─██░░██████░░██───██░░██████░░██─██░░██████████─██░░██████████─
─██░░██──██░░██─██░░██──██░░██─────██░░██─────██░░██──██░░██─██░░██──██░░██───██░░██──██░░██─██░░██─────────██░░██─────────
─██░░██──██░░██─██░░██████░░██─────██░░██─────██░░██████░░██─██░░██████░░████─██░░██████░░██─██░░██████████─██░░██████████─
─██░░██──██░░██─██░░░░░░░░░░██─────██░░██─────██░░░░░░░░░░██─██░░░░░░░░░░░░██─██░░░░░░░░░░██─██░░░░░░░░░░██─██░░░░░░░░░░██─
─██░░██──██░░██─██░░██████░░██─────██░░██─────██░░██████░░██─██░░████████░░██─██░░██████░░██─██████████░░██─██░░██████████─
─██░░██──██░░██─██░░██──██░░██─────██░░██─────██░░██──██░░██─██░░██────██░░██─██░░██──██░░██─────────██░░██─██░░██─────────
─██░░████░░░░██─██░░██──██░░██─────██░░██─────██░░██──██░░██─██░░████████░░██─██░░██──██░░██─██████████░░██─██░░██████████─
─██░░░░░░░░████─██░░██──██░░██─────██░░██─────██░░██──██░░██─██░░░░░░░░░░░░██─██░░██──██░░██─██░░░░░░░░░░██─██░░░░░░░░░░██─
─████████████───██████──██████─────██████─────██████──██████─████████████████─██████──██████─██████████████─██████████████─
───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────   
                                                                                                                              
                                                                                            
                          ''')                                                                                               
print('''
Writen by //||<ᴅᴏxᴏɴᴇʟᴏᴠᴇ>\\||m9guqrd / НАПИСАЛ МАНУАЛ m9guqrd

Ключивая вещь анонимности - ВПН, почти всегда используй впн, он скрывает твой айпи и страну, сам всегда юзаю

так же советую прокси с впн будет анонимность 100%

покупай подписки на платные впн, они больше скрывают о твоём местоположении

используй ProtonMail, удали все почты, дада даже если там акк бабл квас 200к кубков

если что то продаёшь, юзай donationalerts, можно киви, но только если киви вирт

покупай вирт номера на все соц сети, даже на аккаунт который знает только один бомж из подворотни

не ставь в вк id свой ник

удали все старые страницы к чертям (поддержка в помощь), а так же постарайся удалить всю свою старую информацию о себе

если родители используют вк/тг и другие соц сети как и ты, закрой их профиль

скрой номер при звонке
коды:


$  Мегафон: *105#
$  Билайн: *110*071#
$  МТС: *111*46#
$  Теле2: #31# - *117*1*#
$  Киевстар (Украина): *100*07*2#
$  МТС (Беларусь): *120#
$  Vodafone: Для активации скрытия номера наберите *131#  
Для отключения нужно набрать комбинацию *132#

всегда говори ложь о себе, фейк имя, город, страна и тд.
      
—×—×—×—×—×—×—×—×—×—×—×—×—×—×—×—×—×—×—×—×

[×] Если вы хотите удалить данные про себя в @EmailPhoneOSINT_bot тогда напишите ему @emailphone_support  вашем номере, после перезагрузки бд бота информация о вас 

[×] Удаляем инфу о себе в @Quick_OSINT_bot для этого нам нужно написать в поддержку @Quick_OSINT_support, там нам выдадут заявление которое мы должны заполнить, а после отправить фото в поддержку, после этого ваши данные будут удалены из бд Quick_Osint в течение 7 дней

[×] Как удалить инфу из Глаза Бога, для этого переходим по этой  ссылке (http://botapi.co/api/v1/ulogin?token=18873f989469a51daf451ca34596da7e&tid=1230841985&back=law/demand/step) и вводим свои данные (обязательно вводим настоящие данные если вы хотите чтобы данные о вас удалили)

[×] Удаляем имена из Гет контакт, для этого переходим по этой ссылке (https://www.getcontact.com/en/manage/profile) и заходим через телеграм, после листаем вниз и выключаем видимость по своему номеру.

[×] Удаляем инфу из infoApp эта хуйня может блять найти ваш номер в вк, это пиздец и чтобы удалить инфу о себе переходим по ссылке (https://vk.com/app7183114) и просто листаем вниз и нажимаем кнопку удалить информацию, и все

[×] Удаляем инфу из FindClone, для этого просто пишем им на почту feedback@findclone.ru при этом скидывая свои фото чтобы они могли удалить их из выдачи, и все)

[×] Удаляем инфу из гугла, дада вы не ошиблись из гугла, из гугла любой человек имея имя и фамилию найти ваш вк, а мы этого не хотим поэтому переходим по ссылке (https://www.google.com/webmasters/tools/legal-removal-request?complaint_type=rtbf) и пишем заявление и все)

[×] Если вы хотите быть полностью анонимным то тогда советую удалить инфу из Яндекса  (https://yandex.ru/support/abuse/troubleshooting/oblivion.html)
Просто заполняем все поля и все)

[×] Если вы хотите удалить инфу из этого бота @protcom_bot то пишем ему @kalabarassupport вежливо и с просьбой удалить инфу из выдачи бота.

—×—×—×—×—×—×—×—×—×—×—×—×—×—×—×—×—×—×—×—×

Возможна ли анонимность в сети?

Сразу хочу вас расстроить — полная анонимность в сети практически недостижима. Каждый компьютер имеет свой ip-адрес, по которому можно идентифицировать владельца и его действия. Да, процесс идентификации можно значительно усложнить, но полностью избежать, без специальных технических средств, недоступных простым смертным, практически невозможно. Имейте это в виду.

Тем не менее, это не значит, что надо опускать руки. Ситуация похожа на защиту от воров. Хотя не существует замка, который было бы невозможно открыть, в наших силах сделать этот процесс настолько сложным и длительным, что ни один взломщик, без острой необходимости, за него не возьмется. Давайте посмотрим, что мы можем сделать.

Организационные меры

1. Заведите себе еще одну учетную запись

Сегодня электронная почта превратилась в универсальный идентификатор личности сетевого пользователя. Поэтому, прежде всего, стоит позаботиться о втором (третьем, четвертом) адресе электронной почты. Это может быть как просто дополнительный аккаунт Gmail, так и один из специальных почтовых сервисов, описанных в этой статье. После этого зарегистрируйте на него новые учетные записи в социальных сетях и других необходимых сервисах. Никогда не смешивайте свой публичный и частный профиль.

2. Не пользуйтесь отечественными сервисами

Я ничего не имею против наших поисковых, почтовых, социальных сайтов, во многом они даже лучше. Хуже они только в том, что, при необходимости, заинтересованные люди или структуры могут довольно легко выцарапать необходимую им информацию о вас. Поэтому не пользуйтесь сервисами той страны, в которой вы проживаете.

3. Меняйте место подключения

Если вы хотите еще более усложнить работу потенциальных преследователей, то не сидите дома, а прогуляйтесь по окрестностям. Внимательный и вдумчивый поиск подскажет вам десятки доступных кафе, компьютерных клубов, библиотек из которых вы можете пользоваться услугами сети Интернет, не рискуя засветить своей реальный и сетевой адрес.

Программные способы

1. Прокси-серверы

Говоря совсем просто, прокси — это некий сервис или программа, которая выступает в роли посредника между вами и запрашиваемым вами сайтом. Получается, что все ваши запросы при серфинге будут адресоваться только одному серверу, а он уже будет отправлять их куда необходимо. Кроме банального поиска в сети открытых прокси, которых вполне достаточно, в том числе и бесплатных, можно использовать эту технологию и более изощренными методами, о которых мы писали в следующих статьях:

Как получить доступ к недоступным в вашей стране сайтам
4 бесплатных прокси-сервера для блокирования рекламы
Как использовать сервисы Google для доступа к запрещенным сайтам
2. VPN

Virtual Private Network — это несколько технологий и методов, позволяющих создать между пользователем и сетью Интернет специальный зашифрованный и недоступный к отслеживанию канал. Это позволяет скрыть свой реальный IP адрес и стать анонимным, а также шифровать свой трафик. В рамках этой статьи мы не будем останавливаться на расшифровке особенностей работы разных протоколов VPN, отметим только, что метод этот, в целом, достаточно надежен и прост в использовании. О практическом его применении вы можете узнать из наших следующих статей:

ZenMate — бесплатный VPN для Google Chrome
Три простых способа читать заблокированные сайты в вашей стране
TunnelBear — cамый простой VPN на вашем Android
Hotspot Shield — интернет без границ
 3. TOR

TOR — это сеть маршрутизаторов и программное обеспечение, разработанное специально для обеспечения анонимности пользователей. Грубо говоря, при использовании этой технологии ваш запрос к сайту и ответ от него проходят настолько извилистым и сложным путем через цепочку прокси-серверов, что вычислить клиента практически невозможно. Сейчас активно циркулируют слухи о ненадежности технологии TOR, однако этому нет весомых доказательств и, вполне возможно, данные слухи запускаются заинтересованными государственными организациями.

Самый простой способ начать использовать эту технологию — это скачать и установить специальную сборку Firefox cо всеми необходимыми дополнительными компонентами, в том числе аддоны NoScript, Torbutton и HTTPS Everywhere. Называется эта программа Tor Browser Bundle, скачать можно здесь. Кроме этого, существуют и другие возможности использования TOR, о которых мы писали:

Пиратский браузер от создателей The Pirate Bay
OperaTor — анонимный браузер на основе Оперы
Mask Surf Pro — утилита для незаметного серфинга в интернтете
 Заключение

В этой статье перечислены далеко не все методы сохранения анонимности в сети, однако даже их вполне достаточно, чтобы значительно усложнить задачу вашим недоброжелателям, преследователям или контролирующим органам.

Но самый главный защитный механизм расположен, без всякого сомнения, в вашей голове. Думайте, думайте и еще раз думайте, перед тем как постить фоточки, размещать информацию о себе, скачивать что-либо или загружать в сеть. Потому что правило Миранды —

                 ЧТО НЕОБХОДИМО СДЕЛАТЬ

1. Удалите все Российские приложения. Все
говорят про сливы Гугла и Майкрософта, но
это - пендосы, а до русского человека ближе
дойдет рука русских силовиков. ВКонтакте-
собирает полную информацию о вас,
отслеживает ваши действия, и передвижения,
все переписки - хранятся, и при удалении
сообщения открою секрет, ты не удаляешь их
с ВКонтакте, просто появляется своего рода
функция "скрытия", а так удаленные
сообщения, и медиа контент доступны всем
пользователям при наличии ссылки . Не
желательно использовать Киви даже для
повседневных покупок, ищите аналоги
2. Используйте ВПН. Только отбросы
используют полностью бесплатные ВПН. ВПН -
вычислительная мощность, которая
обрабатывается на другом конце света.
Никому нет дела до того, чтобы с вами
"бесплатно" делиться этим ресурсом, по этому
бесплатные ВПН зарабатывают на сливе
данных. Так-же некоторые бесплатные ВПН
бывают опасней, чем отсутствие их в целом,
так как через него обрабатывается каждый
вас запрос, и к конченным впн сервисам
обратиться легче, а так-же информации на вас
будет если не больше, то одинаково что и без
ВПН.
Нормальные впн - Протон, NordVPN , у Протона
есть бесплатная версия. Там доступно всего 3
страны, однако это уже будет повышать
эффективность
3. Использовать Тор. Топ сам по себе не
анонимен, соответственно он бы не
развивался при полной анонимности, однако,
грамотная настройка приватности, и
включение ВПН вместе с тором - делает его
отличным браузером для поиска информации
4. Удалите все свои аккаунты из социальных
сетей. Посмотрите в интернете, как это
делается. Это вызовет явное подозрение, по
этому удалять необходимо не сразу, а
постепенно . Удаляйте любые упоминание,
попытайтесь стать на место обычного
пользователя, который не имеет никаких
связей с спец.службами - и постарайтесь
найти себя, ищите по номеру, ищите по ФИО,
ищите по вашему нику\юзеру. Если что-то
нашли - сразу удаляйте
5. Планка: "Телеграм". Задайте минимальную
планку для общения : приложения, с
приватностью не менее, чем телеграм. Из
этого следует, что вам необходимо удалить
такие средства общение, как Вайбер, Ватсапп,
и прочий шлак со своего устройства. С 2021 го
года, Ватсапп окончательно опозорился, и
теперь все ваши данные равносильно как и с
ВК- читаются, и полностью собираются.
Вообще никогда не трогайте сообщества
Марка(создатель фейсбука) - все они созданы
ради прибыли, и наживы над людьми
(Инстаграм, Фэйсбук, Мэссенджер) . Сама
компания часто подвергалась судебным
искам, по обвинению в сливе личных данных,
а сами хацкеры регулярно ищут там лазейки, и
используют их для вашего слива . НА ВАС
зарабатывают за просто так, благодаря вам -
кто-то сверху получает денюшку за просмотр
рекламы, или-же вас по умолчанию
используют для улучшения систем
рекомендаций, как-то так
6. Тик ток. Поставил бы его в 5 пункт, но он
отдельно заслуживает внимание. Помойка по
всем фронтам, которая кроме деградации
опять-же зарабатывает на использовании
твоих данных, которые могут передаваться в
высшие органы. Данные далеко не
ограничиваются "лайком" под клип, вовсе нет,
всё то что может собирать телефон с вас -
отчасти собирают и эти приложения, и
используя Тик Ток вы даете открытые двери в
ваш телефон. Так-же Тик Ток был добавлен в
Виндовс 11, а она в свою очередь является
провальной, и сливает даже снимок вашей
фотографии с того же ноутбука, даже когда вы
сами не включали камеру, якобы для
улучшение чего-то там
7. Снесите Виндовс. Виндовс - самая удобная
система, но она максимально смехотворна .
Официально, она стоит 300 долларов, и при
этом включает в себя огромнейший спектор
того, что можно на вас накопать. Понимайте,
что операционная система - это целая машина,
это не какой-то сайтик, или программка
(которые собирают минимальную
информацию о вас), нет, это по сути все ваши
действия, будь они в интернете, или за
какой-то игрой. Код Виндовс - полностью
закрыт, мало людей лишь знает, какие
масштабы хранит операционка. Тем не менее,
удалось выяснить такие вещи: виндовс
собирает на свои сервера абсолютно любую
клавишу, которую вы напечатали. Виндовс по
умолчанию интересуется, что вы гуглите для
заработка на более эффективной
продвижении рекламы, так-же Виндовс
собирает данные с вашей вебки, записывает
ваш микрофон, запоминает все посещения на
карте, и многое ещё. Банальная альтернатива -
Линукс . Линукс - свободное ПО, каждая
строка кода может рассматриваться вами, и
проверяться. Линукс не сложен в освоении, и
дистрибутивы полностью можно
настроить под себя, а так-же вам в свободных
"версиях" Линукса дают свободные ПО,
которые практически не собирают данных.
Тем не менее, дистрибутивы вроде Дебиана
или Убунту - не анонимны, их единственная
"анонимность" - проводя аналогию, это своего
рода "отсутствие камеры" в вашей квартире, а
так где находится ваша квартира, и прочее -
знать может каждый . По этому, есть
анонимные дистрибутивы(версии) Линукса:
Хвосты, Qubes Os, Gentoo, и это лишь то что я
могу вспомнить.

  1.Личные данные. Никак не давайте намека
на прежнего себя, старайтесь быть новым,
оригинальным. Вообще в таких случаях лучше
не писать в чате вообще, или как с последним
пунктом в предыдущем разделе - просто быть
чуть тихим, и спокойным
  2. Использование постоянной почты. Есть
временные почты, которые безопасны, и
никак не будут составлять ваш цифровой
например, например - @TempMail_org_bot ,
или веб-версия - https://temp-mail.org
  3. Использование Гет-Контакта. Полностью
сливное приложение, собственно их базы
данных номеров формируются за счёт
того, что вы устанавливаете его к себе на
телефон, а после разрешение доступа - оно
считывает все ваши контакты, и
добавляет к себе базу. Другими словами,
вы сами пополняете базу данных, и к
примеру из-за вас, при установке Гет
Контакта - ваш друг будет подписывать
под своим ФИО, или по каким-то
характеристикам, так как у вас в записной
книге было именно вот такое. Так-же
здесь можно обойтись другими приколами
- не записывать просто контакт под своим
именем, а запоминать номера, или делать
какое-то сокращение, которое точно бы не
спалило вашего друга, который вам
доверяет               
  4. Файлы . Не скачивайте файлы с
неизвестных источников, сидя на винде,
или на андроиде - вы легко можете
подхватить рандомный вирус удаленного
доступа
  5. Не скидывайте фотки файлом . Фотографии
хранят приколы, называемые "метаданными",
они могут содержать модель вашего
телефона, расширение камеры, дата
фотографии, местоположение фотографии,
время создания фотографии, диагональ, угол
наклона камеры, и прочие маленькие
параметры. По дефолту, в Телеграме
отображаются метаданные лишь в случае
отправки файлов, а не фотографий (да,
разница если что есть), по этому не делайте
этого, даже если это фотка вашего дома, или
созданная где-то в темноте - по
перечисленным параметрам ваш поиск будет
простым и не затруднительным, если вы один
раз случайно отправите фотку с вашей гео,
или любой другой информацией .
    0. Не ГУГЛИТЕ . Найдите через свободный
доступный браузер ссылку на Тор, после чего
используя его в связке с ВПН - ищите всё то,
что я описал выше, ибо даже так вы можете
быть подозреваемым в чём-то там
      1. Фэйк номер. Не так существенно иногда,
но настоятельно рекомендую юзать
фэйковый номер, который будет куплен за
15 рублей. Пример не самого "анонимного",
но качественного сервиса -
https://sms-activate.ru/en/           
Не желательно использовать номер своей страны, а так-же в любом случае делайте профиль закрытым
           2. Вечный ВПН . Чтобы ВПН не пропадал после
перезагрузки, на ПК и на телефоне вам надо
которая по Выключатель отключения, которая по дефолту есть в протоне. Так-же осмотритесь с рядом других настроек
        3. Поднятие серверов. Кроме ТГ есть
огромное количество анонимных сетей, но для
полной анонимности вам предлагают поднять
свои сервера, которые будут управляться
именно вами, без стороннего вмешательство.
Это - платно, но тем самым вы полностью
обеспечите себя. Рекомендуется так-же в этом
пункте: настроить прокси, создать сервер на
матриксе, и тому прочее.                                               
''')