import os


COLOR_CODE = {
        "BLUE": "\033[34m",
        "RESET": "\033[0m",
    }
os.system("cls")
print(f'''{COLOR_CODE["BLUE"]} 
                                                                                 
                                                                                 
                                                                                     
                                                                                     
───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
─████████████───██████████████─██████████████─██████████████─██████████████───██████████████─██████████████─██████████████─
─██░░░░░░░░████─██░░░░░░░░░░██─██░░░░░░░░░░██─██░░░░░░░░░░██─██░░░░░░░░░░██───██░░░░░░░░░░██─██░░░░░░░░░░██─██░░░░░░░░░░██─
─██░░████░░░░██─██░░██████░░██─██████░░██████─██░░██████░░██─██░░██████░░██───██░░██████░░██─██░░██████████─██░░██████████─
─██░░██──██░░██─██░░██──██░░██─────██░░██─────██░░██──██░░██─██░░██──██░░██───██░░██──██░░██─██░░██─────────██░░██─────────
─██░░██──██░░██─██░░██████░░██─────██░░██─────██░░██████░░██─██░░██████░░████─██░░██████░░██─██░░██████████─██░░██████████─
─██░░██──██░░██─██░░░░░░░░░░██─────██░░██─────██░░░░░░░░░░██─██░░░░░░░░░░░░██─██░░░░░░░░░░██─██░░░░░░░░░░██─██░░░░░░░░░░██─
─██░░██──██░░██─██░░██████░░██─────██░░██─────██░░██████░░██─██░░████████░░██─██░░██████░░██─██████████░░██─██░░██████████─
─██░░██──██░░██─██░░██──██░░██─────██░░██─────██░░██──██░░██─██░░██────██░░██─██░░██──██░░██─────────██░░██─██░░██─────────
─██░░████░░░░██─██░░██──██░░██─────██░░██─────██░░██──██░░██─██░░████████░░██─██░░██──██░░██─██████████░░██─██░░██████████─
─██░░░░░░░░████─██░░██──██░░██─────██░░██─────██░░██──██░░██─██░░░░░░░░░░░░██─██░░██──██░░██─██░░░░░░░░░░██─██░░░░░░░░░░██─
─████████████───██████──██████─────██████─────██████──██████─████████████████─██████──██████─██████████████─██████████████─
───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
                                                                                                                                                                                         
                          ''')                                                                                               
print('''
Способы исполения:
1.Телефония(skype)
2.Email(gmail,proton,yandex)

Какие бывают виды сваттинга?
Всё зависит от возраста жертвы,если вы не делаете просто эвакуацию.
т.e.
1.Опекой(меня бьют ,маму щас зарежут нахуй)
2.Мunup0BaHue(бомба в здании, спасайте задницы)
3.Вызов служб(пожар,газовая утечка)
4.Сказать что человек деанонер или сватер(заберут пк)
5.Угрозы от человека(типо этот хочет поджечь мой дом)
и т.д.

Стоит заметить,что нам нужны ДАННЫЕ жертвы,для разных способов они варьируются от номера+фио ,до просто номера

Как находить данные я учить не буду,но,помните,что если вы хотите кого-то сватнуть,то глаз бобика вам может и не помочь

                                                 ПРАКТИКА
Буду разбирать сначала способ сватом гмаилом,расскажу что да как,другие сервисы вроде протона иногда не отправляют,поэтому их не советую

1.Скачиваем Tor Browser(https://torproject.netcologne.de/ru/download/)
2.Скачиваем Mullvad VPN(https://mullvad.net/ru/download/vpn/windows),ключи можно найти на раздачах лолзгуру
3.Включаем прокси(Делаем следующее: Кликаем “Пуск” и открываем “Параметры”. Выбираем раздел “Сеть и Интернет”. Открываем пункт “Прокси-сервер” и перетаскиваем ползунок на “Вкл.”; Вводим IP-адрес и порт промежуточного сервера)
Бесплатные прокси можно найти на сайте: https://ru.proxy-tools.com/proxy?ysclid=llm9xarqgp366599394
4.Настраиваем Mullvad и Tor(поищите в инете хуле)
5.Создаем почту Гмаил с ФИ жертвы или с его именем,прим:(andreysmirnov@gmail.com,andreyukraine2008@gmail.com)
6.Выберите способ исходя от возраста жертвы и как вы хотите его наказать(лучше всего минирование)
7.Ищем под это все здание(или его адрес если выбрали 3 пункт),желательно искать Больницу с почтой,например: (киев,городская больница номер 4,clinik4@health.kiev.ua,адрес:03110, Киев, ул. Соломенская, 17.)
8.Ищем почты СМИ(не отправляйте в СБУ или ФСБ такие письма,это бесполезно,отправьте на почты мвд и СМИ),почты гос органов Украины тут:(https://ua.spinform.ru/adr.html?ysclid=llma3xhgyy21057100) или в резерве почт в тг(в поиске можно найти),почты сми украины:(http://www.ukr-biz.net/directory/17.htm)
9.Делаем текст и список почт,текст думаю все знают как делать,но самое главное обходить банворды прим:(3amuHup0Baл,Teppakt,3aл0жHuku и тд)
10.Рассылаем текст по почтам и готово!

Способ телефонией
1.Качаем муллад и делаем прокси как в первом способе
2.Качаем скайп(https://www.skype.com/ru/get-skype/)
ДЛЯ ЭТОГО СПОСОБА НУЖНЫ ДЕНЬГИ НА СКАЙП(700 рубликов где-то)
3.Покупаем сабку на номера мобильные+стационарные на месяц по какой стране будем делать
4.Качаем изменитель голоса(https://www.voicemod.net/) и настраиваем его(в ютубе есть ролики)
Проверить работает-ли войсмод можно тут:(https://online-voice-recorder.com/ru/?ysclid=llmaees9xc461425512)
5.Ищем номер сбу или мвд города жертвы и говорим подготовленный текст.

Пр, сегодня в этом мануале, я вам дам совет о том, как сватать по Telegram'y.

Что нам нужно для полноценного свата???

1. Аккаунт телеграмм с Вирт номером.
2. ВПН
3. Proxy.

На счет 2-го, и 3-го пункта, щас объясню понятнее.

ВПН - Для смены IP-Адреса.

Proxy - Подмена серверов, работает также само, как и ВПН.

ВПН можно скачать абсолютно любой.

Прокси можно заменить в своем телеграмме.

1. Заходим в ТГ.

2. Пишем в поиске: ProxyMTProto ( https://t.me/ProxyMTProto / @ProxyMTProto )

Выбираем любой Прокси, и нажимаем: Connect.

Потом нажимаем: "Подключить Прокси".

Готово, теперь у вас подключен прокси, теперь приступаем к самому свату.

••••••••••••••••••••••••••••••••••••••••••••••••••••

Ищем в интернете Т0RG0VblЙ Ц3NTR, который будем минировать.

Там должен быть:

Сайт центра

Номер телефона

Адрес.

••••••••••••••••••••••••••••••••••••••••••••••••••••

Когда нашли номер телефона торгового центра, который собрались минировать, делаем следующее:

1. Заходим в ТГ.

2. Нажимаем на 3 полоски

3. Выбираем пункт "Контакты"

4. Нажимаем на человека с "+" ниже.

У вас должно высветится:

"Новый Контакт" .

5. Подписываем торговый центр, как вам угодно, и пишем внизу номер телефона.

6. Потом нажимаем: "Создать Контакт".

••••••••••••••••••••••••••••••••••••••••••••••••••••

Если у вас будет ошибка, по типу: (Торговый Центр) Пока не использует Telegram, то ищите другой торговый центр, с другим номером телефона, и попробуйте добавить.

••••••••••••••••••••••••••••••••••••••••••••••••••••





<3

способ для мелких
звоним и говорим "Мне поступают угрозы с номера +7**********  Адрес "Дом Пушкина 2 номер 3 подъезд 4 дом 18 этаж 8 квартира 67"
Или говорим: "Данный человек собрал данные обо мне " Ему (например) 12 лет, т.д. 
Или что-то другое например: "Данный человек поджог дом, покалечил сына, или что то другое.

Способ для бесстрашных челиков
сват по почте

что нам нужно:
номер телефона жертвы
почта(вирт)
номер телефона(скрытый) textnow в помощь
анонимность
VPN

вот вам сайты школ для рассылки
s_3.edu54.ru
school185.kiev.sch.in.ua
school28-buch@mail.ru
sch2.ru/
school17smolensk@mail.ru
@edu.mos.ru
sait@1-shkola.ru

Рассылаем по школам сообщения по типу:
Mbl ZamenirоваLu vашy ШkoLy. Bomba ckoro вzorvёtcя. за 30 tbIcяч bomba bydet obezvreжena.
и если вам повезло и вы были анонимны на 100%, вас не забрали в ментуру


Ещё сервисов:


ОГРОМНАЯ ПОДБОРКА сервисов для пробива

?? Поиск по телефону

+ @PROdean_bot — поддерживает поиск по номеру автомобия и VIN коду. Найдет телефон, email, как владелец записан в контактах, базах данных и досках объявлений, аккаунты в соц. сетях и мессенджерах, в каких чатах состоит, документы, адреса и многое другое
+ @dosie_Bot — как и в боте uabaza дает информацио о паспорте только польностью
+ @get_kontakt_bot — найдет как записан номер в контактах, дает результаты что и getcontact
+ @GetFb_bot — бот находит Facebook
+ @info_baza_bot — поиск в базе данных
+ @mailsearchbot — найдет часть пароля

?? Поиск по Email адресу

+ @PROdean_bot — Найдет телефон, email, как владелец записан в контактах, базах данных и досках объявлений, аккаунты в соц. сетях и мессенджерах, в каких чатах состоит, документы, адреса и многое другое
+ @info_baza_bot — покажет из какой базы слита почта
+ @last4mailbot — бот найдет последние 4 цифры номера телефона клиента Сбербанка
+ @mailsearchbot — ищет по базе, дает часть пароля
+ @StealDetectorBOT — найдет утекшие пароли
L @GetGmail_bot — бот найдет адрес почты Gmail к которой привязан искомый email

?? Поиск по номеру авто

+ @PROdean_bot —  Найдет телефон, email, как владелец записан в контактах, базах данных и досках объявлений, аккаунты в соц. сетях и мессенджерах, в каких чатах состоит, документы, адреса и многое другое
+ @AntiParkonBot — найдет номер телефона владельца
+ @OpenDataUABot — поиск по украинским номерам
+ nomerogram.ru — найдет фото автомобиля, поиск по гос номеру

?? Поиск по судну

+ seatracker.ru - карта движения судов в реальном времени
+ shipfinder.co - карта движения судов
L marinetraffic.com — найдет позывной, MMSI, рейсы и историю имени судна

?? Поиск по самолету

Поиск по позывному самолета
+ de.flightaware.com — найдет историю перелетов, даст общую информацию о воздушном судне
L planefinder.net — найдет историю перелетов, даст общую информацию о воздушном судне

Поиск по модели самолета
+ rzjets.net — база моделей джетов, найдет владельца, регистрационный номер и многое другое
+ flightradar24.com — найдет все самолеты онлайн и в истории

?? Поиск по Документам

+ @egrul_bot — поиск по ОГРНИП и ИП

?? Ресурсы по физ. лицам
+ fms.gov.ru — проверка действительности паспортов гражданина РФ
+ fssp.online — поиск задолженности по СНИЛС, ИНН, СТС, номеру ИП, ВУ и паспорта, поиск бесплатный
+ fssprus.ru — проверка задолженностей
+ kad.arbitr.ru — дела, рассматриваемые арбитражными судам, проверяем тут же Ипшников
+ propfr.ru — проверка СНИЛС
+ service.nalog.ru — найдет ИНН, нужно знать полное ФИО и дату рождения
+ a-3.ru — находит все задолженности и подробную информацию о налоговых начислениях

?? Ресурсы по юр.лицам
+ cbr.ru — справочник по кредитным организациям, поиск по названию, регистрационному номеру, ОГРН
+ gks.ru — предоставление данных бухгалтерской отчетности
+ nalog.ru — проверка блокировки банковских счетов
L privatization.lot-online.ru — поиск в электронной торговой площадке

Это сборник самых популярных мануалов будет на разных каналах в телеграме)


''')