banner = '''
                                                            ╔══════════════════════════════════════════════════════════════════════════════════════════════╗  
                                                            ║                                                                                              ║  
                                                            ║                                                                                              ║ 
                                                            ║   ▀███▀▀▀██▄       ██     ███▀▀██▀▀███     ██     ▀███▀▀▀██▄     ██      ▄█▀▀▀█▄████▀▀▀███   ║
                                                            ║    ██    ▀██▄    ▄██▄    █▀   ██   ▀█    ▄██▄      ██    ██    ▄██▄    ▄██    ▀█ ██    ▀█    ║  
                                                            ║    ██     ▀██   ▄█▀██▄        ██        ▄█▀██▄     ██    ██   ▄█▀██▄   ▀███▄     ██   █      ║ 
                                                            ║    ██      ██  ▄█  ▀██        ██       ▄█  ▀██     ██▀▀▀█▄▄  ▄█  ▀██     ▀█████▄ ██████      ║  
                                                            ║    ██     ▄██  ████████       ██       ████████    ██    ▀█  ████████  ▄     ▀██ ██   █  ▄   ║  
                                                            ║    ██    ▄██▀ █▀      ██      ██      █▀      ██   ██    ▄█ █▀      ██ ██     ██ ██     ▄█   ║  
                                                            ║   ▄████████▀ ▄███▄   ▄████▄  ▄████▄  ▄███▄   ▄████▄████████▄███▄   ▄████▄▀█████▀▄██████████  ║
                                                            ║                                            TOOL                                              ║
                                                            ║                                                                                              ║
                                                            ║                                                                                              ║
                                                            ║                                        ╔═════════════╗                                       ║  
                                                            ╠════════════════════════════════════════╣DATABASE v2.0╠═══════════════════════════════════════╣ 
                                                            ║       [&] 1 Dev - qqwizzixxxx          ╚═════════════╝                                       ║ 
                                                            ║       [&] Github   https://github.com/qqwizzixxxx/Database-DOX                               ║  
                                                            ║       [&] Telegram: https://t.me/+8NPtID8H9Oc1MDUy                                           ║
                                                            ╠══════════════════════════════════════════════════════════════════════════════════════════════╣ 
                                                            ╚══════════════════════════════════════════════════════════════════════════════════════════════╝
                                                                          ╔══════╗                        ╔═════════╗                    ╔═══════╗
                                                            ╔═════════════╣SEARCH╠═════════════╦══════════╣FAKE INFO╠══════════╦═════════╣MANUALS╠═════════╗
                                                            ║             ╚══════╝             ║          ╚═════════╝          ║         ╚═══════╝         ║  
                                                            ║ [1] Поиск по номеру              ║ [13] Генератор паспортов      ║ [25] Мануал по Анонимности║                                                                                             
                                                            ║ [2] Поиск по почте               ║ [14] Генератор Mullvad        ║ [26] Мануал по Доксу      ║                                                                                 
                                                            ║ [3] Поиск по банк.карте          ║ [15] Генератор Банк.Карт      ║ [27] Мануал по OSINT      ║                
                                                            ║ [4] Поиск по IP                  ║ [16] Генератор почт           ║ [28] Мануал по Деанону    ║
                                                            ║ [5] Поиск по ФИО                 ║ [17] Генератор паролей        ║ [29] Мануал по Сносу ТГ   ║
                                                            ║ [6] Поиск по телеграм            ║ [18] Генератор СНИЛСОВ        ║ [30] Мануал по Сносу ВК   ║
                                                            ║ [7] Поиск по ВК                  ║ [19] Генератор ИНН            ║ [31] Телеграм Боты        ║
                                                            ║ [8] Поиск по СНИЛСУ              ║ [20] Генератор Ру.номеров     ║ [32] Мануал по Деанону ДС ║
                                                            ║ [9] Поиск по Фейсбуку            ║ [21] Генератор Укр.номеров    ║ [33] Мануал по Swat       ║
                                                            ║ [10] Поиск по ИНН                ║ [22] Генератор МАК Адресов    ╠═══════════════════════════╣
                                                            ║ [11] Поиск по логину             ║ [23] Генератор Фейк Информации║ 2 Dev - @ArbuzerProtected ║                                                                  
                                                            ║ [12] Поиск по паролю             ║ [24] Генератор IP Адресов     ║ 3 Dev - R0YAL|GXZ         ║
                                                            ║                                  ║            ╔═════╗            ║ 4 Dev - @ImInfoFinder     ║
                                                            ╚══════════════════════════════════╬════════════╣OTHER╠════════════╬═══════════════════════════╝
                                                                                               ║            ╚═════╝            ║
                                                                                               ║ [35] SMSbomber    [36] DDOS   ║
                                                                                               ║ [99] Exit         [?] About   ║
                                                                                               ╚═══════════════════════════════╝
'''
