import os

COLOR_CODE = {
        "BLUE": "\033[34m",
        "RESET": "\033[0m",
    }
os.system("cls")
print(f'''{COLOR_CODE["BLUE"]} 
                                                                                 
                                                                                 
                                                                                     
                                                                                     
▓█████▄  ▄▄▄     ▄▄▄█████▓ ▄▄▄       ▄▄▄▄    ▄▄▄        ██████ ▓█████ 
▒██▀ ██▌▒████▄   ▓  ██▒ ▓▒▒████▄    ▓█████▄ ▒████▄    ▒██    ▒ ▓█   ▀ 
░██   █▌▒██  ▀█▄ ▒ ▓██░ ▒░▒██  ▀█▄  ▒██▒ ▄██▒██  ▀█▄  ░ ▓██▄   ▒███   
░▓█▄   ▌░██▄▄▄▄██░ ▓██▓ ░ ░██▄▄▄▄██ ▒██░█▀  ░██▄▄▄▄██   ▒   ██▒▒▓█  ▄ 
░▒████▓  ▓█   ▓██▒ ▒██▒ ░  ▓█   ▓██▒░▓█  ▀█▓ ▓█   ▓██▒▒██████▒▒░▒████▒
 ▒▒▓  ▒  ▒▒   ▓▒█░ ▒ ░░    ▒▒   ▓▒█░░▒▓███▀▒ ▒▒   ▓▒█░▒ ▒▓▒ ▒ ░░░ ▒░ ░
 ░ ▒  ▒   ▒   ▒▒ ░   ░      ▒   ▒▒ ░▒░▒   ░   ▒   ▒▒ ░░ ░▒  ░ ░ ░ ░  ░
 ░ ░  ░   ░   ▒    ░        ░   ▒    ░    ░   ░   ▒   ░  ░  ░     ░   
   ░          ░  ░              ░  ░ ░            ░  ░      ░     ░  ░
 ░                                        ░                           
                                                                                                                                                                                       
                          ''')                                                                                               
print('''
 Инструменты OSINT, которые ускорят исследования в сети.


• Содержание:
1. Несколько полезных сайтов, которые юзаю лично я.
2. Поиск по ФИО.
3. Поиск по номеру телефона.
4. Поик по лицу.
5. Поисковые Cистемы Людей.
6. Поиск по никнейму.
7. Проверка айпи адресов.
8. Cоветы по эффективному поиску и проведению расследований с помощью методов OSINT.



1. Несколько полезных сайтов.
[!] Содержимое раздела:

• https://checkusernames.com/ - Поиск по никнеймам, в него входят огромное колл-во сайтов.
• https://online-vk.ru/ - Покажет скрытых друзей, так же, покажет вам друзей из закрытого профиля.
• https://220vk.com/ - Сайт, который сможет показать скрытых друзей и не только.
• https://findclone.ru/ - Поиск по "клонам", определяет внешность человека, тем самым выдает страницу ВКонтакте на пользователя с максимально похожими чертами лица.
• Keyword Tool (https://keywordtool.io/)
Платформа показывает ключевые слова по введенному запросу на любом языке и по любой стране. В некоторых запросах даже видно, насколько они популярны, хотя эта услуга платная. Можно искать ключевые слова по Google, YouTube, Twitter, Instagram, Amazon, eBay, Play Store, Bing.
Ища по Google, можно, например, выбрать ключевые выражения, содержащие в себе вопросительные слова или предлоги. А слева есть фильтры, где можно искать по ключевым словам уже в получившейся выдаче.
• https://vk.com/tool42 - Приложение ВК, можно достать немного информации.
• https://www.kody.su/check-tel#text - На данной странице можно определить сотового оператора и регион (или город и страну) по любому номеру телефона в России или в мире.
• https://vk.watch/ - история профилей ВКонтакте, требуется подписка.

Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х

2. ФИО 
L Поиск ФИО 
[!] Содержимое раздела: 

• Occrp (https://aleph.occrp.org/) — поиск по базам данных, файлам, реестрам компаний, утечкам, и другим источникам 
• Locatefamily (https://www.locatefamily.com/) — найдет адрес 
• Infobel (https://www.infobel.com/fr/world) — найдет номер телефона, адрес и ФИО
• Rocketreach (http://rocketreach.co/) — поиск людей в linkedIn, Facebook и на других сайтах, находит email 
• @egrul_bot (https://t.me/@egrul_bot) — найдет ИП и компании 
• Яндекс.Люди (https://yandex.ru/people) — поиск по социальным сетям ( Закрыто/удалено самим Яндексом)
• реестр залогов (https://www.reestr-zalogov.ru/state/index) — поиск по залогодателям, даст паспортные данные, место и дату рождения и т.д. 
• @HowToFind_bot Данный бот — разведчик, который может подсказать различные секреты и приемы по OSINT. Он содержит в себе кучу всевозможных баз и ссылок.
• @AvinfoBot — Один из самых интересных ботов, который после ввода номера телефона выдаст вам ссылки на социальные сети, марку и номер автомобиля, а также оператора и даже все объявления обладателя этого номера в Avito.
• @buzzim_alerts_bot — Поисковый бот и в то же время avalanche-сервис, с помощью которого можно искать людей по нику и отслеживать упоминания в новостях.
• @mailsearchbot — В 2014 году в DarkNet утекли 1,5 млрд. паролей от email-адресов. Так вот, этот бот реализует поиск по этим email-адресам и выдает пароль. Рекомендую вам проверить все свои email-адреса с помощью этого бота.
• @deanonym_bot — Ну, а с помощью данного бота можно узнать номер любого пользователя Telegram. Просто отправляете ему логин без @ и он выдаст вам номер.
• @list_member_bot — За счет этого бота можно выгрузить все никнеймы участников тех или иных Телеграм-чатов. Польза конечно от него минимальная с точки зрения разведки, но он в значительной степени автоматизирует данный процесс.
• @telesint_bot — Иногда может потребоваться пробить того или иного юзера Telegram в открытых чатах. Этот бот без проблем поможет справиться с этой задачей.

Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х

3. Телефон
L Поиск по номеру телефона
[!] Содержимое раздела:

• Lampyre (https://account.lampyre.io/email-and-phone-lookup) — веб
версия поиска по любому номеру телефона, поиск по аккаунтам и телефонной книге - от себя: полезная вещь в osint-сфере, не раз спасала меня.
• Getcontact (https://getcontact.com/) — найдет информацию о том как записан номер в контактах - от себя: Сайт хороший, но я думаю, что бот в телеграмме будет на много удобнее для Вас.
• Truecaller (https://www.truecaller.com/) — телефонная книга, найдет имя и оператора телефона - от себя: Вещь годная, но долго возиться
• Bullshit (https://mirror.bullshit.agency/) — поиск объявлений по номеру телефона - Иногда нужен VPN
• @numberPhoneBot (https://t.me/@numberPhoneBot) — найдет адрес и ФИО, не всегда находит
• Spravnik (https://spravnik.com/) — поиск по городскому номеру телефона, найдет ФИО и адрес
• @info_baza_bot (https://t.me/@info_baza_bot) — поиск в базе данных
• @find_caller_bot (https://t.me/@find_caller_bot) — найдет ФИО владельца номера телефона
• @usersbox_bot (https://t.me/@usersbox_bot) — бот найдет аккаунты в ВК у которых в поле номера телефона указан искомый номер
• @getbank_bot (https://t.me/@getbank_bot) — дает номер карты и полное ФИО клиента банка
• @eyegodsbot - Телеграмм бот, часто радовал меня, есть бесплатные пробивы по машинам, лицу, номеру телефона, есть платный контент.
• @egrul_bot - Пробивает конторы/ИП, по вводу ФИО/фирмы предоставляет ИНН объекта; учредителей бизнеса/партнеров и отчет налоговую декларацию. И наоборот: поиск по ИНН выдаст ФИО/конторы. Базы данных сами понимаете откуда. Ограничений бота – нет.
• @mnp_bot 
• @xinitbot 
• @black_triangle_tg 

Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х

4. Лицо
L Поиск лицу
[!] Содержимое раздела:

• FindTwin face search demo + @VkUrlBot (бот подобие сайта)— https://findclone.ru/
• Face search • PimEyes — https://pimeyes.com/en/
• Betaface free online demo — Face recognition, Face search, Face analysis — http://betaface.com/demo_old.html
• VK.watch – история профилей ВКонтакте — https://vk.watch/

Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х

5. Поисковые системы
L Поисковые Cистемы Людей:
[!] Содержимое раздела:

• https://www.peekyou.com/
• https://pipl.com/
• https://thatsthem.com/
• https://hunter.io/
• https://www.beenverified.com/

Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х

6. Никнейм
L Поиск по никнейму: 
[!] Содержимое раздела:

• https://checkusernames.com/
• https://namechk.com/
• https://knowem.com/
• http://simcast.com/

Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х

7. Ip-адрес.
L Проверка айпи адресов:
[!] Содержимое раздела:

• https://whatismyipaddress.com/
• http://www.ipaddresslocation.org/
• https://lookup.icann.org/
• https://www.hashemian.com/whoami/

Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х

8. Cоветы по эффективному поиску и проведению расследований с помощью методов OSINT
Классическая методология OSINT, которую вы найдете повсюду, проста:
[!] Содержимое раздела:

1. Определите требования: что вы ищете?
2. Получите данные.
3. Анализируйте собранную информацию.
4. Сводные данные и отчетность. Далее, либо повторите поиск путем комбинации только что собранных данных, либо завершите расследование и напишите отчет.

Очень часто во время расследований мы теряемся в объеме собранных данных, и трудно понять, в каком направлении следует копать. В этом случае, я думаю, будет полезно сделать перерыв и вернуться к шагам 3 и 4: проанализируйте и суммируйте то, что вы нашли, перечислите, что может помочь вам развить и определите новые (или более точные) вопросы, на которые все еще нужны ответы.

Другие советы, которые я бы дал:

Никогда не сдавайтесь: возможно, у вас будет ощущение, что вы изучили все возможности получения информации о цели. Но не сдавайтесь. Сделайте перерыв (час или день, занимаясь чем-то другим), затем снова проанализируйте входные данные и попытайтесь взглянуть на них с другой точки зрения.

Храните доказательства: информация исчезает онлайн очень быстро. Представьте, что человек, которого вы ищите, начинает что-то подозревать, внезапно все его учетные записи в социальных сетях и веб-сайты могут быть удалены им из сети. Так что храните доказательства: скриншоты, веб-архивы, а
Поиск по объявлениям на Авите
mirror.bullshit.agency
не только ссылки на онлайн ресурсы. В криминалистике, ключевым моментом является сбор событий, происходящих в одно и то же время. Когда был создан сайт? Когда была создана учетная запись FB? Когда было написано последнее сообщение в блоге?
      
Приветствую, друг! Данный мануал предназначен для новичков, поэтому и был слит бесплатно.
Итак, преступим.
Для начала расскажу о самом термине *осинт*
осинт - поиск данных по открытым источникам, т.е всевозможные боты, данные с сайтов, и дохуя всего прочего.
в данном мануале рассмотрю осинт поиск имея нейм(ник) недоброжелателя.
для начала можно закинуть ник в глаз бога » поиск по контактам.
для чего это делать? во-первых, таким образом можно найти номер, почты, город, всевозможные адреса и уйму побочной информации (к слову, на меня можно найти валидку данным способом, xd)
в случае, если нам ничего не дало, тогда надеемся на то, что глаз боба нас покормит и по тегу/айди нам выдаст номер.
если же и сейчас промах, то моможет только си.
если же нам дало номер, то раскидываем его по различным ботам, по типу глаза бога, квик осинт, зернерда и другие.
как по мне, самый лучший бот для поиска информации по номеру - юзербокс, ибо кол-во бд там даёт о себе знать, и очень часто можно найти что-либо.
с большей долей вероятности, нам даст какую-либо информацию, это может быть все что угодно, но мы рассмотрим вариант фи(о) + дата рожения.
первым делом добавляем номер в контакты у себя в телефоне, и ищем его таким способом в вк, но все можно заменить куда более простым способом - просто ввести фи(о) и город.
мы нашли вк, что дальше? тут уже завсисит от того, пустой ли окажется сам аккаунт, если повезет, там могут быть его родственники в друзьях, а у них в свою очередь фото. вбиваем в поиск друзей жертвы его фамилию, и смотрим результат.
я не могу гарантировать то, что там что-либо окажется, но если же нам снова повезло, то копируем ссылку на вк, и бежим в глаз боба, юзербокс, зернерду.
дропаем туда ссылку на вк, и с шансом 75% там что-то выдаст (номер, почту, возможно адрес и тп).
мы нашли родственников, можно попытаться найти школу. делается это достаточно просто, просматриваем всех друзей, и ищем часто повторяющиеся номера школ, а дальше путем си/логики находим нужную нам (я например писал кому-то, и спрашивал с твоей ли школы этот человек, если да, то какой класс, хочу познакомиться)
Запомните: главная уязвимость любой, даже самой защищенной системы — человек.
У многих может возникнуть логичный вопрос:
, ну для чего мне сдалась социальная инженерия, если я собираюсь работать в легальном поле? Для чего мне обманным путем заставлять человека что-либо делать?

Опять же, возьму и отвечу:
Социальная инженерия применятся белыми хакерами при аудите организации. В данном случае используются все возможные способы попасть в корпоративную инфраструктуру организации, в том числе и через работников.

Если вы решили устроится на должность специалиста по кибербезопасности, то ОБЯЗАНЫ знать все приемы социальной инженерии от А до Я. Если ценного специалиста из вашей компании уволят из-за того, что он открыл зараженный файл, то это будет в первую очередь ваша вина, т.к. вы не учли существование социальной инженерии или халатно к этому отнеслись, не проинформировав сотрудников об опасности должным образом.
И это только самые очевидные примеры, на самом деле сфер применения гораздо больше.
3.1 Что и где изучить?
Во-первых, статьи по теме на нашем канале Hacker Place. Используйте поиск по каналу, введя слово «инженерия», найдете уйму полезной информации.

Во-вторых, хотел бы порекомендовать вам книгу Кевина Митника — Искусство обмана.
Кевин Митник — это человек, благодаря которому слова «хакер» и «социальная инженерия» стали общеизвестными. Он начинал, когда и компьютеров в массовом пользовании не было, и многие телефоны были с дисковым номеронабирателем. Сегодня он работает консультантом по компьютерной безопасности, а 30 лет назад был первым хакером в США и самой желанной добычей ФБР.


Книга The Art of Deception - "Искусство обмана" - доказывает, насколько мы все уязвимы. В современном мире, где безопасность подчас выходит на первый план, на защиту компьютерных сетей и информации тратятся огромные деньги. Деньги тратятся на технологии безопасности. Эта книга объясняет, как просто бывает перехитрить всех защитников и обойти технологическую оборону, как работают социоинженеры и как отразить нападение с их стороны Кевин Митник и его соавтор, Бил Саймон рассказывают множество историй, которые раскрывают секреты социальной инженерии. Авторы дают практические советы по защите от атак, по обеспечению корпоративной безопасности и снижению информационной угрозы "Искусство обмана" не только демонстрирует, насколько опасна и вредоносна социоинженерия, но поможет разработать собственную программу тренинга по безопасности для сотрудников компании.
Ссылка на скачивание книги в формате .pdf (кликабельно)
4. OSINT
Начну с того, что OSINT — это полностью легальное направление.

OSINT (Open Source INTelligence) — это разведка по открытым источникам, то есть поиск информации о человеке или организации по базам данных, которые, теоретически, доступны всем.
Чаще всего OSINT используется для сбора информации о конкретном человеке. Но также его можно использовать для поиска информации о конкретных организациях, в том числе для оценки их защищенности.

В рамках кибербезопасности OSINT используется для пентеста, форензики, реверсивной и социальной инженерии.
Пентестеры используют OSINT для оптимизации первого этапа работы: разведки и сбора информации об определенном онлайн-объекте или субъекте. В этом случае OSINT необходим, чтобы наметить цели, которые нужно атаковывать, или понять, что ломать ничего не нужно – оно и так для всех доступно.
Так же считаю важным отметить, что OSINT — это самодостаточное направление. Т.е. вы можете работать исключительно в нем, осуществляя сбор досье на людей или компании. Что касается среднего прайса по рынку:
30.000 руб. стоит досье на человека.
40.000-50.000 руб. стоит досье на компанию.
Согласитесь, доход в 150-200 тысяч рублей в месяц при таких возможностях, скорее начало чем потолок.
Подводя итог
Как вы видите, все перечисленные мной направления одинаково важны для профессионального хакера.

Невозможно изучить только одно из них и считать себя профи. Что бы начать хорошо зарабатывать, необходимо комплексно изучить все приведенные выше ниши.
''')                 