import os

COLOR_CODE = {
        "BLUE": "\033[34m",
        "RESET": "\033[0m",
    }
os.system("cls")
print(f'''{COLOR_CODE["BLUE"]} 
                                                                                 
                                                                                 
                                                                                     
                                                                                     
▓█████▄  ▄▄▄     ▄▄▄█████▓ ▄▄▄       ▄▄▄▄    ▄▄▄        ██████ ▓█████ 
▒██▀ ██▌▒████▄   ▓  ██▒ ▓▒▒████▄    ▓█████▄ ▒████▄    ▒██    ▒ ▓█   ▀ 
░██   █▌▒██  ▀█▄ ▒ ▓██░ ▒░▒██  ▀█▄  ▒██▒ ▄██▒██  ▀█▄  ░ ▓██▄   ▒███   
░▓█▄   ▌░██▄▄▄▄██░ ▓██▓ ░ ░██▄▄▄▄██ ▒██░█▀  ░██▄▄▄▄██   ▒   ██▒▒▓█  ▄ 
░▒████▓  ▓█   ▓██▒ ▒██▒ ░  ▓█   ▓██▒░▓█  ▀█▓ ▓█   ▓██▒▒██████▒▒░▒████▒
 ▒▒▓  ▒  ▒▒   ▓▒█░ ▒ ░░    ▒▒   ▓▒█░░▒▓███▀▒ ▒▒   ▓▒█░▒ ▒▓▒ ▒ ░░░ ▒░ ░
 ░ ▒  ▒   ▒   ▒▒ ░   ░      ▒   ▒▒ ░▒░▒   ░   ▒   ▒▒ ░░ ░▒  ░ ░ ░ ░  ░
 ░ ░  ░   ░   ▒    ░        ░   ▒    ░    ░   ░   ▒   ░  ░  ░     ░   
   ░          ░  ░              ░  ░ ░            ░  ░      ░     ░  ░
 ░                                        ░                              
                                                                                                                                                                                  
                          ''')                                                                                               
print('''снос фамок в вк:
У данного пользователя запрещённый символ фамилии, который запрещен в вк.

Данный пользователь -


 снос страницы:

Здравствуйте! Данный пользователь, рассылает порногафические фотографии, в личные сообщения и в конференции.
Ссылка на страницу:
Доказательства:
Прошу заблокировать нарушителя


Здравстуйте!
Данный пользователь использует рейд - бота, заспамливая конференции, для тролинга.
Сообщения отметил как спам, подал жалобу через спец. Интерфейс,
Ссылка на пользователя :


Здравстуйте! Данное сообщество накручивает подписчиков/Лайки

Прошу списать накрученую статистику или же заблокировать сообщество .

Ссылка на сообщество :


Здравстуйте! Данный пользователь накручивает подписчиков / друзей / лайков.

Прошу списать накрученую статистику или же заблокировать пользователя.

Ссылка на страницу :

Здравствуйте!
Данный пользователь использует сторонние программы для накрутки подписчиков/лайков.
Ссылка на страницу:

для сноса фамилий и имени:

Здраствуйте! Данная особь - "ссылка" использует некк. имя (или фамилию или все вместе имя и фамилию) которая никак не может соответствовать с паспортом данного человека, прошу принять меры

для снова леваков где стоит дедик:

Здраствуйте! Данные страницы замечены в подозрительной активности
1.
2.
3.
4. и т.д,если есть ещё


Прошу проверить активность данных страниц и принять меры в случае необходимости

для снова накрученных лайков или фотографий:

Здраствуйте! Данный человек накручивает лайки
Ссылка на данную особоь -
Ссылка на фотографию где были накручены лайки(пост и т.д,а если накрутка фото, то кидаешь альбом где накручены фотографии) -
Прошу принять меры и скрутить накрученную статистику

Чтобы ликвидировать страницу ВКонтакте нам надо:
• полностью изучить страницу жертвы.
—-------------------------------------------------------------------------------------—
Теперь я вам опишу причины блокировки страницы ВК.
• продажа способов накрутки лайков ВК.
• продажа услуг DDoS атак или методов.
• продажа услуг сноса, взлома страниц ВК, YouTube.
• продажа услуг деанонимизаций.
• угрозы в личных сообщениях.
—-------------------------------------------------------------------------------------—
Если на странице есть одно из выше причин, делайте следуещее.
• Переходим по ссылке — https://vk.com/support?act=new&from=dislike&i..
Пишем тех. поддержке:
• Здравствуйте, тех поддержка ВКонтакте. Хочу пожаловаться на одну персону (ссылка).
• Дело в том, то что он продаёт услуги DDoS атак, а так-же методы DDoS атак.
• Ссылка на заметку с продажей DDoS методов и услуг: (ссылка на заметку).
• А так-же скриншоты:
После этого, жертву на 100% снесут.
—-------------------------------------------------------------------------------------—
• Переходим по ссылке — https://vk.com/support?act=new&from=dislike&i..
Пишем тех. поддержке:
• Здравствуйте, тех поддержка ВКонтакте. Хочу пожаловаться на одну персону (ссылка).
• Дело в том, то что он продаёт услуги накрутки лайков.
• Ссылка на заметку с продажей услуг накрутки лайков: (ссылка на заметку).
• А так-же скриншоты:
После этого, жертву на 75% снесут.
—-------------------------------------------------------------------------------------—
• Переходим по ссылке — https://vk.com/support?act=new&from=dislike&i..
Пишем тех. поддержке:
• Здравствуйте, тех поддержка ВКонтакте. Хочу пожаловаться на одну персону (ссылка).
• Дело в том, то что он продаёт услуги взлома/блокировки страниц, групп ВК.
• Ссылка на заметку с продажей услуг взлома/блокировки страниц ВК (ссылка на заметку).
• А так-же скриншоты:
После этого, жертву на 100% снесут.
—-------------------------------------------------------------------------------------—
• Переходим по ссылке — https://vk.com/support?act=new&from=dislike&i..
Пишем тех. поддержке:
• Здравствуйте, тех поддержка ВКонтакте. Хочу пожаловаться на одну персону (ссылка).
• Дело в том, то что он продаёт услуги деанонимизаций, а это не законно.
• Ссылка на заметку с продажей услуг деанонимизаций (ссылка на заметку).
• А так-же скриншоты:
После этого, жертву на 50% снесут.
—-------------------------------------------------------------------------------------—
• Переходим по ссылке — https://vk.com/support?act=new&from=dislike&i..
Пишем тех. поддержке:
• Здравствуйте, тех поддержка ВКонтакте. Хочу пожаловаться на одну персону (ссылка).
• Дело в том, то что он угрожал мне в личных сообщениях, а это не законно.
• А так-же скриншоты:
После этого, жертву на 35% снесут.
—-------------------------------------------------------------------------------------—


1.для сноса страницы вк нам потребуется подать жалобу, заходим сюда https://vk.com/support?act=new&from=h&i d=8842 2. Если у жертвы в товарах есть способ накрутки вк, пишем: "Здраствуйте, данный человек, продаёт способы накрутки вк, прошу принять меры." Если нет, то просто пишем в лс почему ты меня кинул, далее делаем скрин кидаем жертву в чс, и скрин где вы писали что данный человек вас кинул отправляем в тех.поддержку. 3.Ждем бан страницы. By Верховный.
Здравствуйте, тех поддержка вконтакте.Сегодня, я бы хотел пожаловаться на одну страницу которая занимаеться вымагательством, а вот это уже закон.Прошу вас удалить эту страницу, так как это в правилах запрещено. (работает не всегда

Здравствуйте. Пользователь на своей странице продает скрипт для накрутки лайков.
Как я знаю, накрутка лайков запрещена правилами ВКонтакте. Разве его не должны заблокировать за такое




Здравствуйте тех поддержка в контакте! Данный пользователь, пишет в личные сообщения матерные слова,
Ссылка на страницу:
Доказательства:
Прошу заблокировать нарушителя
Здравстуйте!
Данный пользователь использует рейд - бота, заспамливая сообщения, для тролинга и прочих нужд
Сообщения отметил как спам, подал жалобу через спец. Интерфейс,
Ссылка на пользователя :
Здравстуйте! Данный человек накручивает подписчиков/лайки

прошу списать накрученую статистику или же заблокировать человека, потому-что в вк этот закон имеет другие правило

Ссылка на человека:
У данного пользователя странная фамилия, и имя вк,это разрешено в вк?
Ссылка человека:
Здравствуйте!
Данный пользователь использует сторонние программы для накрутки подписчиков/лайков прошу списать накрученое количество накрученого ,по законом вк это наказуемо
Ссылка на страницу:
Проверьте
Здравствуйте тех поддержка в контакте, данный человек пытается троллить меня и материть ,а так же оскорблять родственников и друзей ,прошу принять меры безопасности в контакте, ограничить доступ к его странице
Ссылка на человека:
Здравствуйте ! Разве разрешено писать маты в личные сообщения ,и оскорблять личность просто так? Прошу заблокировать доступ к странице этого человека который мог угрожать и писать не цензурные слова
Ссылка на человека:
Тех поддержка в контакте! Мне в личные сообщения пишут маты,это принципиально и принудительно попрошу принять меры и закрыть доступ этого автора к странице
Ссылка на человека:
Здравствуйте ! Человек начинает меня троллить матерными словами прошу принять меры осторожности и безопасности,и заблокировать доступ к странице
Ссылка на человека:

—-------------------------------------------------------------------------------------—
Вот и все, я не даю 100% гарантии на то, что вы сможете ликвидировать страницу жертвы
      
Для начала находим сервис накрутки.

Делаем пост у себя на левой странице и Указываем любую ссылку, например ссылку на картинку.

Дальше просим жертву зарепостить ваш пост, тут уже в помощь Социальная Инженерия.

Когда он репостнул, редактируйте пост и ссылку меняйте на сайт накрутки.

Оба ака снесут.
''')      