import os


COLOR_CODE = {
        "BLUE": "\033[34m",
        "RESET": "\033[0m",
    }
os.system("cls")
print(f'''{COLOR_CODE["BLUE"]} 
                                                                                 
                                                                                 
                                                                                     
                                                                                     
▓█████▄  ▄▄▄     ▄▄▄█████▓ ▄▄▄       ▄▄▄▄    ▄▄▄        ██████ ▓█████ 
▒██▀ ██▌▒████▄   ▓  ██▒ ▓▒▒████▄    ▓█████▄ ▒████▄    ▒██    ▒ ▓█   ▀ 
░██   █▌▒██  ▀█▄ ▒ ▓██░ ▒░▒██  ▀█▄  ▒██▒ ▄██▒██  ▀█▄  ░ ▓██▄   ▒███   
░▓█▄   ▌░██▄▄▄▄██░ ▓██▓ ░ ░██▄▄▄▄██ ▒██░█▀  ░██▄▄▄▄██   ▒   ██▒▒▓█  ▄ 
░▒████▓  ▓█   ▓██▒ ▒██▒ ░  ▓█   ▓██▒░▓█  ▀█▓ ▓█   ▓██▒▒██████▒▒░▒████▒
 ▒▒▓  ▒  ▒▒   ▓▒█░ ▒ ░░    ▒▒   ▓▒█░░▒▓███▀▒ ▒▒   ▓▒█░▒ ▒▓▒ ▒ ░░░ ▒░ ░
 ░ ▒  ▒   ▒   ▒▒ ░   ░      ▒   ▒▒ ░▒░▒   ░   ▒   ▒▒ ░░ ░▒  ░ ░ ░ ░  ░
 ░ ░  ░   ░   ▒    ░        ░   ▒    ░    ░   ░   ▒   ░  ░  ░     ░   
   ░          ░  ░              ░  ░ ░            ░  ░      ░     ░  ░
 ░                                        ░                             
                                                                                                                                                              
                          ''')                                                                                               
print('''
Для начала давайте подготовимся
Вам нужно:
•50+- разных почт/Отправщик с возможностью смены почт
•Подготовить текст для жалобы
•Подготовить почты,куда вы будете это всё отправлять

!Почты можно купить оптом где-нибудь на маркетах в инете типа даркстора или лолза,отправщики можете найти спросив у кого-то в км

•Текст
Вот вам шаблончик,его можно использовать для всех типов правил,главное только его переформулировать под канал и нарушение

Здравствуйте,уважаемый модератор телеграмм,хочу пожаловаться вам на пользователя/канал,который (причина). 
Tg или ссылка на тгк: 
Id или ссылка на нарушение: 
Доказательства-скриншоты: 
(заливаете скриншот нарушения на любой сайт-хост картинок и кидаете сюда ссылку,фото должно быть без любой обработки)
Просьба заблокировать данный аккаунт/канал.

•Почты,куда надо отправлять
sms@telegram.org, dmca@telegram.org, abuse@telegram.org, sticker@telegram.org, stopCA@telegram.org, recover@telegram.org, support@telegram.org, security@telegram.org

!Примечание
Полной гарантии блокировки конечно нет. Но то что канал уже попадёт под наблюдение –это точно. 
И при последующих нарушениях с таким каналом точно не будут церемонится. 
В одиночку заблокировать канал Телеграмм достаточно трудно, но возможно.

!Жизнь упрощают софты для отправки и отправщики в телеге,а так же боты для сносов типо c1report.

•Пропаганда насилия
Из той-же серии – призывы к терроризму
•Незаконное распространение музыкальных произведений (песен, саундтреков и альбомов)
•Порнография
Из той-же категории контент эротического содержания
•Неоднократный спам (более 3-ех раз)
•Постоянное использование ботов в чате
телеграмм использование ботов
•Постоянная навязчивая самореклама в чате
•Использование на канале исполняемых файлов (АРК или EXE)
Из той-же категории – не делайте ссылки на исполняемые файлы. Две последние категории нежелательны из-за возможности быть замаскированным вирусом.
•Нарушение авторских прав. Здесь чаще всего «попадают под раздачу» каналы с загруженными фильмами. Ссылка на ролик ЮТУБ здесь вам в помощь.
Модераторы Телеграмм очень подозрительно относятся к каналам или чатам, где используется общение не на языке канала. То есть, если канал русскоязычный, а вы там общаетесь на условно китайском языке, то это уже повод поставить канал в серый список. Модераторам и администраторам Телеграмм такие каналы очень трудно, а иногда и невозможно модерировать.
•Ну и напоследок, не приветствуется массовое использование стикеров и гифок. Здесь тоже все просто, cтикеры или картинки с жестами понимаются в разных культурах по-разному. И если где-нибудь в России этот стикер будет означать приветствие, то где-нибудь в республике Зимбабве этот же стикер будет означать угрозу насилия.
Отдельной темой и поводом для блокировки стоит реклама услуг финансового характера.

•Любой аккаунт может быть заблокирован. Если использует принципы финансовых пирамид, так называемые схемы Левина Понци. То есть, клиентов заманивают высокими процентами или дивидендами, но полученные деньги не вкладываются, а с них выплачиваются проценты старым клиентам.
•Различные партнерские программы не приветствуются модераторами Телеграмм. То есть те аккаунты. В которых основная цель: получение процентов от каждого нового клиента компании, на которую стоит ссылка с аккаунта, могут попасть в вечный банн.
•Реферальные схемы, где есть посылы или обещания бесплатных денег или валюты.
•Ставки или схемы инвестиций любого рода
•Про «обнажёнку» и порнография я уже говорил
•Оскорбления и унижения группы людей. Группы людей могут быть разными, объединены по расовому признаку, религии, полу, возрасту, национальности и пр.
•Жестко модерируются аккаунты в которых выявлены факты притеснения
Канал блокируется, если в нем есть факты разглашения чужих личных данных. Это могут быть: ФИО, фото, адреса проживания и номера телефонов.


Дальше схема действий проста. Пишем модераторам на эту почту abuse@telegram.org. И излагаем конкретно факты нарушений правил телеграмм чужого канала. По опыту. Одной жалобы будет совершенно недостаточно для блокировки аккаунта. Создаём много левых почт, и пишем жалобы с них разделяя их по времени. Если таких жалоб будет несколько (число зависит от аккаунта). То в течении нескольких недель аккаунт может быть заблокирован.

Полной гарантии блокировки конечно нет. Но то что канал уже попадёт под наблюдение –это точно. И при последующих нарушениях с таким каналом точно не будут церемонится. В одиночку заблокировать канал Телеграмм достаточно трудно, но возможно.

Для начала нужно изучить тг канал. если в канале публикуют деаноны/личную инфу то это будет легко, можно написать в поддержку такое обращение "Здравствуйте, администрация. Я (представляемся жертвой деанона) хочу пожаловаться на канал ( ссылка ) здесь недавно слили мои данные, вы можете увидеть это в этом посте ( ссылка на пост ). Прошу заблокировать этот телеграм канал и по возможности ограничить администраторам доступ к соцсети, заранее, спасибо."
Далее нам надо закинуть получившийся текст в переводчик на английский , и отправить на почту abuse@telegram.org .

•Оскорбления и унижения группы людей. Группы людей могут быть разными, объединены по расовому признаку, религии, полу, возрасту, национальности и пр.

•Использование на канале исполняемых файлов (АРК или EXE)
Из той-же категории – не делайте ссылки на исполняемые файлы.

__________________________________________________________
''')                        