import os

COLOR_CODE = {
        "BLUE": "\033[34m",
        "RESET": "\033[0m",
}
os.system("cls")
print(f'''{COLOR_CODE["BLUE"]} 
                                                                                 
                                                                                 
                                                                                     
                                                                                     
 ───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
─████████████───██████████████─██████████████─██████████████─██████████████───██████████████─██████████████─██████████████─
─██░░░░░░░░████─██░░░░░░░░░░██─██░░░░░░░░░░██─██░░░░░░░░░░██─██░░░░░░░░░░██───██░░░░░░░░░░██─██░░░░░░░░░░██─██░░░░░░░░░░██─
─██░░████░░░░██─██░░██████░░██─██████░░██████─██░░██████░░██─██░░██████░░██───██░░██████░░██─██░░██████████─██░░██████████─
─██░░██──██░░██─██░░██──██░░██─────██░░██─────██░░██──██░░██─██░░██──██░░██───██░░██──██░░██─██░░██─────────██░░██─────────
─██░░██──██░░██─██░░██████░░██─────██░░██─────██░░██████░░██─██░░██████░░████─██░░██████░░██─██░░██████████─██░░██████████─
─██░░██──██░░██─██░░░░░░░░░░██─────██░░██─────██░░░░░░░░░░██─██░░░░░░░░░░░░██─██░░░░░░░░░░██─██░░░░░░░░░░██─██░░░░░░░░░░██─
─██░░██──██░░██─██░░██████░░██─────██░░██─────██░░██████░░██─██░░████████░░██─██░░██████░░██─██████████░░██─██░░██████████─
─██░░██──██░░██─██░░██──██░░██─────██░░██─────██░░██──██░░██─██░░██────██░░██─██░░██──██░░██─────────██░░██─██░░██─────────
─██░░████░░░░██─██░░██──██░░██─────██░░██─────██░░██──██░░██─██░░████████░░██─██░░██──██░░██─██████████░░██─██░░██████████─
─██░░░░░░░░████─██░░██──██░░██─────██░░██─────██░░██──██░░██─██░░░░░░░░░░░░██─██░░██──██░░██─██░░░░░░░░░░██─██░░░░░░░░░░██─
─████████████───██████──██████─────██████─────██████──██████─████████████████─██████──██████─██████████████─██████████████─
───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────  
                                                                                                                            
                                                                                            
                          ''')                                                                                               
print('''
Для начала подготовимся к сбору информации о пользователе дискорда
Создаём текстовый документ на рабочем столе и пишем туда следующую информацию:
⛧ Юзер дискорд пользователя
⛧ Ник дискорд пользователя
⛧ Все привязки дискорд пользователя
⛧ Возможно человек указал тг или вк(или что-либо ещё) в описании,это тоже нам надо
⛧ Дискорд id пользователя(если есть)

1.Первоначально хочу указать на следующий сайт - https://discord-tracker.com/onetime-functions/all/
В нём можно узнать старые фотографии пользователя и в целом изменения профиля дискорд пользователя.
Собираем всё это и включаем в наш текстовый документ

2.Делаем intext:text в google.com и yandex.ru со всеми никами и юзерами  дискорд пользователя
Вы должны собрать как можно больше зацепок по человеку и максимально проанализировать все полученные данные.
Каждая зацепка может дать абсолютно рандомную информацию,даже старый аккаунт стима или удаленные данные на сайте,которые,кстати можно посмотреть нажав на три точки в гугле или яндексе и нажав сохранённая копия сайта
Может дать вам как старые ники,так и фи,номер,почту и тд

3.По привязкам-переходим,анализируем,всю информацию переносим в текстовый документ и используем как зацепки.
Помните,что даже гитхаб привязка может дать вам ФИ и страну человека,так что это обязательный пункт.

4.Если у человека есть тг или вк,указанный в профиле или другая социальная сеть,то соответственно делаем анализинг страничек,как анализировать это всё надо писать в отдельном  мануале,но думаю вы умные и сами сможете
Собираем всё с этих страничек,вбиваем в текстовый документ и идём дальше

5.Имея дискорд id пользователя можно использовать его для парсеров дс аккаунтов и,возможно,для ботов деанона,вроде UniversalSearch
Какие именно парсеры дс аккаунтов и скрипты использовать решать вам,сам я знаю их мало и особо  не использую,поэтому,эту часть оставлю на вас

6.Плагины дискорд-клиента(https://betterdiscord.app/plugins) (КАКИЕ ИМЕННО Я ХЗ,УЖЕ ДАВНО НЕ ЮЗАЮ) 
Помогут найти страну,данные человека,информацию о профиле пользователя и ещё много чего полезного

7.Айпилоггеры и другие методы получения айпи-адреса и другие стиллеры данных вроде фишинга.
Найти можно в интернете,но самый качественный способ узнать айпи-адрес человека-попросить его зайти на любой аккаунт сервиса,который дает айпи юзеров аккаунта.

Используя эти методы,в 90% случаев вы сможете найти валидную информацию на человека,если вы не криворукий и тупой.
      
1. support.discord.com — инструкция как найти Discord ID аккаунта
2. discord.id — показывает дату создания и фото
3. discordhub.com — находит сервера
4. discordleaks.unicornriot.ninja — находит сервера и сообщения
5. hugo.moe — показывает дату создания аккаунта
6. app.element.io (r) — найдет сохранённую копию аккаунта по ID, это имя и аватар, после регистрации, нажми на +, и выбери "начать новый чат", введи id в поиск
7. discord-tracker.ru (r) — выдает дату регистрации, статистику активности, сервера в которых учувствует аккаунт, история имени, история аватара, события в голосовом, сообщения, популярные слова, возможные друзья, статистика активности, и прочее
8. ⚡️@UniversalSearchRobot — по Discord ID или тегу аккаунта найдет профили Discord на сторонних ресурсах


Через URL

1. https://top.gg/user/1234567890987654321 — находит в каких серверах состоит, фото, описание профиля, и прочее, замени 1234567890987654321
на Discord ID аккаунта

1. discordservers.com — дает ссылку на вступление
2. discord.center — дает ссылку на вступление, в базе 36К серверов
3. disboard.org — дает ссылку на вступление, в базе 700К+ серверов
4. discord.me — дает ссылку на вступление, в базе 30К+ серверов
5. discordbee.com — дает ссылку на вступление, в базе 5К+ серверов
    
Парсеры
1. dht.chylex.com — загрузит историю выбранного текстового канала до первого
сообщения и позволит вам загрузить его для просмотра в автономном режиме в вашем
браузере
2. exportcomments.com — экспортирует весь чат из вашего канала Discord в файл CSV      
''')