import os

COLOR_CODE = {
        "BLUE": "\033[34m",
        "RESET": "\033[0m",
    }
os.system("cls")
print(f'''{COLOR_CODE["BLUE"]} 
                                                                                 
                                                                                 
                                                                                     
                                                                                     
───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
─████████████───██████████████─██████████████─██████████████─██████████████───██████████████─██████████████─██████████████─
─██░░░░░░░░████─██░░░░░░░░░░██─██░░░░░░░░░░██─██░░░░░░░░░░██─██░░░░░░░░░░██───██░░░░░░░░░░██─██░░░░░░░░░░██─██░░░░░░░░░░██─
─██░░████░░░░██─██░░██████░░██─██████░░██████─██░░██████░░██─██░░██████░░██───██░░██████░░██─██░░██████████─██░░██████████─
─██░░██──██░░██─██░░██──██░░██─────██░░██─────██░░██──██░░██─██░░██──██░░██───██░░██──██░░██─██░░██─────────██░░██─────────
─██░░██──██░░██─██░░██████░░██─────██░░██─────██░░██████░░██─██░░██████░░████─██░░██████░░██─██░░██████████─██░░██████████─
─██░░██──██░░██─██░░░░░░░░░░██─────██░░██─────██░░░░░░░░░░██─██░░░░░░░░░░░░██─██░░░░░░░░░░██─██░░░░░░░░░░██─██░░░░░░░░░░██─
─██░░██──██░░██─██░░██████░░██─────██░░██─────██░░██████░░██─██░░████████░░██─██░░██████░░██─██████████░░██─██░░██████████─
─██░░██──██░░██─██░░██──██░░██─────██░░██─────██░░██──██░░██─██░░██────██░░██─██░░██──██░░██─────────██░░██─██░░██─────────
─██░░████░░░░██─██░░██──██░░██─────██░░██─────██░░██──██░░██─██░░████████░░██─██░░██──██░░██─██████████░░██─██░░██████████─
─██░░░░░░░░████─██░░██──██░░██─────██░░██─────██░░██──██░░██─██░░░░░░░░░░░░██─██░░██──██░░██─██░░░░░░░░░░██─██░░░░░░░░░░██─
─████████████───██████──██████─────██████─────██████──██████─████████████████─██████──██████─██████████████─██████████████─
───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────   
                                                                                                                                                                                    
                          ''')                                                                                               
print('''
I - BASE 

Базовый уровень 
Пасты, для публикации деанонимизаций 
ghostbin.co 
 
pastebin.co 
 
doxbin.org 
 
paste4btc.com 
 
pastebin.com 
 
doxbinmxoyrb4x7f.onion 
--- 
Частные группы вк, репост в основную группу вк, удаление поста в частной группе вк 
 
Статьи Telegram 
 
Поверхостный поиск информации по социальным сетям(VK,OK,Facebook) 
 
VK 
Чтобы найти такую информацию, как ФИО, Дата рождения и Учебное заведение: 
 
Приступим. Заходим на страницу жертвы, жмем вкладку "Друзья", идем в адресную строку, видим после "friends" цифры. Копируем. 
 
Сразу предупреждаю, это не работает на юзеров с id начинающимся на 440 и далее. 
 
Заходим сразу на Google и Яндекс. Вбиваем данные цифры и добавляем в их начало "id". Здесь пути расходятся: может выбить много результатов, чекаем их все и собираем информацию (Может выбить имя при регистрации ВК (Как напрямую, так и через сторонние ресурсы типа VKFaces), телефон, канал, группы). Но может произойти так, что не будет найдено ни одного результата. Идем на страницу юзера и смотрим дату рождения. 87% пользователей указывают дату рождения (без года, но его легко вычислить). Идем в друзья. Выбираем город (Может выбить Москву, Санкт-Петербург (Юзер действительно может находиться в данных городах)), чекаем 3 город после Москвы и Питера (если меньше 10 человек чекаем 220vk.com, проверяем скрытых если есть, сравниваем их, либо же проверяем города выше). Итак, люди найдены. Смотрим их даты рождения, а заодно и школы. Каких годов оказалось больше, того же года и юзер, которого мы раскрываем. Идем на OK.RU. Вбиваем имя юзера. Выбираем город. Может быть не найдено ничего. Значит чекаем по дате рождения, выбивает 100% результат. Получаем ФИ, и в 50% случаев и отчество за счет чека друзей и наличия отца. Если отца нет, ищем его вручную. Как? Добавляем к 18 годам возраст раскрываемого юзера, например: юзеру 14 лет, значит отцу 14+18=от 32 лет. Ищем по заданным критериям, получаем 100% результат. 
 
Если вы сомневаетесь в том, является та, или иная страница альтом человека, нужно уметь сопоставлять информацию. Расскажу вкратце: вы просто анализируете его онлайн. Если человек заходит с телефона, проверяем его лог-ин'ы через телфон в углу справа. Например, недавно я деанонил Дениса Ильина и не мог определить его фамилию, т.к. людей с именем Денис и одной и той же датой рождения было двое. Я зашел ко всем на страницы и смотрел онлайн. Денис Тестовик (основа деанонимизируемого) был онлайн почти все время с телефона, один подозреваемый был параллельно с телефона, а это взаимоисключающий фактор. Оставалась страница второго подозреваемого, с которой заходили с периодичностью в 3-5 часов, что говорит о том, что это и был деанонимизируемый. 
 
Сервисы: 
https://vk.com/app7183114 
@InfoVkUser_bot  
@FindNameVk_bot 
@GetPhone_bot  
220vk.com 
https://online-vk.ru/pivatfriends.php?id=123456789 Заменить айди(Друзья закрытого аккаунта) 
 
Odnoklassniki 
То же, что и VK 
⁣⁣Как узнать номер телефона аккаунта ВК через Одноклассники 
 
Список способов поиска в социальных сетях: 
 
1. Имя (без фамилии) + город (районный центр/поселок/село) + дата рождения (число) 
 
2. ИФ + город (путем отсеивания результатов) 
 
3. Город (районный центр) + полная дата рождения 
 
4. Поиск родственников по фамилии (если известен возраст, в фильтрах ставим возраст ОТ по арифметической формуле 18+ полный возраст жертвы), далее поиск в друзьях странных имен, ников (если не удается найти старые страницы по настоящим данным) 
 
5. Идентификатор канала на YouTube в Google (позволяет узнать старое название канала) 
 
[1] В ВК добавьте аккаунт в друзья 
 
[2] Перейдите в Одноклассники и откройте раздел мои друзья 
 
[3] Нажмите на кнопку 'добавить друзей из ВК' 
 
[4] Если аккаунт нашелся, то скопируйте ссылку на найденный аккаунт ОК 
 
[5] Перейдите по этой ссылке (https://ok.ru/password/recovery) и выберите восстановить через профиль 
 
[6] Вставьте в поле ссылку которую вы скопировали на профиль и нажмите искать 
 
В результате вы получите часть номера телефона и e-mail адреса 
 
Сервисы: 
ok.city4me.com 
 Если вы узнали Facebook ID через сервисы по типу lampyre.io, нужно узнать по этому ID страницу.Об этом писалось на одноименном посте на стаковерфлоу. 
Ссылка - https://stackoverflow.com/questions/12827775/facebook-user-url-by-id 
Сервисы: graph.tips 
whopostedwhat.com 
lookup-id.com (Узнать айди аккаунта фейсбук) 
 
Так же можно искать ID аккаунта в гугл, тем самым получив больше зацепок. 
@usersbox_bot (Найдет аккаунты VK, у которых указан данный Facebook) 
 
https://facebook.com/browse/mutual_friends/?uid=USERID&node=USERID — найдет общих друзей, которые имеют общедоступные списки друзей, если у одного из искомых пользователей есть общедоступный список друзей, замените USERID на ID аккаунта 
 
Мультисервисы для поиска информации по различным данным 
https://thatsthem.com 
 
https://www.spokeo.com 
 
https://pipl.com 
 
https://nuga.app/ 
 
https://www.fastpeoplesearch.com 
 
https://www.truepeoplesearch.com 
 
https://www.familytreenow.com 
 
https://socialcatfish.com/ 
 
https://usersearch.org/ 
 
https://lampyre.io/ 
 
https://dehashed.com/ 
 
Получение информации с почты/номера телефона 
Производить пробив по почте можно также при помощи так называемого Google Dorks. Проще говорят это правильный и целенаправленный запрос в поисковике Google 
 
“@example.com” site:example.com — находит почтовые ящики на определенном домене. 
 
HR “email” site:example.com filetype:csv | filetype:xls | filetype:xlsx — находит контакты HR в формате xls, xlsx и csv на определенном домене. 
 
site:example.com intext:@gmail.com filetype:xls — вытаскивает ID электронных почтовых ящиков (в данном случае Gmail) из определенного домена. 
 
Как я уже говорил правильно сформированный запрос в гугл может выдать крайне много полезной информации. Нужно лишь уметь пользоваться данным инструментом. 
 
Пробив по почте 
 
https://haveibeenpwned.com/ 
 
https://ghostproject.fr 
 
Сервис, который показывает пароли к взломанным e-mail https://intelx.io/ 
 
Таблица почта-пароль https://drive.google.com/open?id=1yDi7mjE50f3vCRt0GB-QlnR01uM5gTRz 
 
Есть ресурс (https://www.exploit-db.com/google-hacking-database) , который собрал в себе огромный список этих запросов и что с их помощью можно получить. Там не только пробив информации. Имеющиеся там примеры запросов помогут найти также слитые пароли, незащищенные документы и базы, различные устройства к которым можно подключиться и т.д. 
 
Так же есть сервис fth.su, где имеется база сервиса leakcheck, (ну и майнкрафт ники) 
 
Очень полезный сервис —lampyre.io 
 
https://nuga.app/ - Поиск Instagram аккаунта по номеру телефона. 
 
https://mirror.bullshit.agency - Поиск обьявлений на досках обьявлений по номеру телефона. 
 
https://nomer.org - одна из баз данных адресов 
 
Ошибка <h1>503 Bad Gateway</h1> на DonatePay/DonationAlerts - если пользователь использует донат-сервисы, вы можете попытаться узнать его номер сделав ошибку через просмотр кода элемента на странице оплаты. Работает по сей день. 
 
http://com.lullar.com 
 
http://www.emailfinder.com 
 
http://www.spokeo.com/email-search 
 
http://ctrlq.org/google/images/ 
 
http://emailchange.com/ 
 
Правильное использование поисковиков для поиска информации 
https://www.rush-analytics.ru/blog/seo-gid-po-poiskovym-operatoram-google 
 
Большое количество вспомогательных сервисов 
Трекеры это инструмент сбора данных о пользователях для аналитики. Используются на сайтах и в приложениях. Каждый трекер имеет свой уникальный номер который укзан в исходном коде веб страницы. Пример: UA-123456789 — трекер Google Analytics. 
 
shodan.io — найдет IP адреса и сайты с упоминанием кода трекера 
2. spyonweb.com — поиск сайтов по трекерам pub, UA 
 
3. intelx.io (https://intelx.io/tools?tab=analytics) — найдет сайты с искомым трекером UA, 6 источников поиска 
 
Поиск через URL 
www.shodan.io/search?query=http.html%3AUA-12345678-1 — найдет сайты с таким же трекером, замените UA-12345678-1 на свой код трекера 
Прочее


II HARD

Профессиональный уровень 
Мощнейший пробив селлер 
Найдет то, что не найдут люди в погонах за шекели 
 
https://rutor.wtf/forums/detektiv-kolombo-probiv-po-vsem-strukturam.177/ 
 
Phone Infogra 
Мощный инструмент для пробива информации по номеру(мультисервисы) 
 
https://github.com/sundowndev/PhoneInfoga 
 
Sherlock 
Самый мощный известный мне инструмент по пробиву ника 
 
https://github.com/sherlock-project/sherlock 
 
Photon 
Очень сильный кравлер(Выгрузка информации с сайтов) 
 
https://github.com/s0md3v/Photon 
 
Библия пентестера 
Крупнейший сборник информации по пентесту, что тебе пригодится в будущем.Информация на английском, и информации настолько дохуя, что эге по английскому языку ты сдашь на нехуй делать. 
 
https://github.com/blaCCkHatHacEEkr/PENTESTING-BIBLE 
 
Если же тебе это нахуй не интересно, держи материал с этой библии для OSINT 
 
4500 гугл дорков — https://sguru.org/ghdb-download-list-4500-google-dorks-free/ 
 
OSINT Ресурсы 2019 — https://medium.com/p/b15d55187c3f 
 
OSINT Тулкит — https://medium.com/@micallst/osint-resources-for-2019-b15d55187c3f 
 
Визуализация информации OSINT — https://medium.com/hackernoon/osint-tool-for-visualizing-relationships-between-domains-ips-and-email-addresses-94377aa1f20a 
 
Instagram OSINT — https://medium.com/secjuice/what-a-nice-picture-instagram-osint-8f4c7edfbcc6 
 
Наилучший сборник OSINT 
https://github.com/jivoi/awesome-osint 
 
СЛОЖНЕЙШИЙ ИНСТРУМЕНТ SPIDERFOOT(Lampyre Lighthouse на стероидах) 
https://github.com/smicallef/spiderfoot 
 
Для тебя это будет заданием — поставить эту хуету, и подключить все бесплатные API 
 
Общий OSINT GitHub топик 
https://github.com/topics/osint 
 
IP Logger в Telegraph 
Берешь, заходишь на сайт IPLOGGER и выбираешь Invisible Image 
 
Профессиональный уровень, изображение №1 
Получаешь ссылку, заходишь в статью Telegraph, нажимаешь кнопку «вставить код» 
 
Профессиональный уровень, изображение №2 
Вставляешь свою ссылку на IpLogger 
 
Профессиональный уровень, изображение №3 
И дописываешь .jpg 
 
Профессиональный уровень, изображение №4 
Вот и все 
Ссылка на статью с логгером — https://telegra.ph/dfdgdfg-07-18 
 
ПАЩ 
 
https://book.cyberyozh.com/ru/?fl=ru - Курс по интернет безопаности 
 
Гениальная поебота для шифровки файлов - https://www.aescrypt.com/ (Шифруешь все важное и тд(на курсе кибережа есть гайд, вроде 56 пункт) 
 
У тебя уже есть батник, который добавляет в firewall все трекеры майкрософт, т.е мы исключаем возможности подрыва нашей будущей связки WIFI-PC`Сервера Microsoft`TOR~ Советую: Не использовать микрофон Не палить свои личные данные НИКОМУ(вот у мя есть на тя инфа могу ебнуть как муху и все) Не использовать антивирус и прочее В качестве браузера советую выбрать Mozilla Firefox с адоннами c Level Midle Сообственно говоря, перейдем к самой связке Как пустить весь трафик через Tor 
 
Существует несколько способов решить эту проблему. Мы можем использовать Tor Bundle, о котором мы писали в статье «Запуск Tor автоматический». Но используя этот способ вы можете столкнуться с проблемой деанонимизации. Трафик который не поддерживает Tor может попросту выбежать и попасть в сеть в в открытом виде, тем самым засветив ваш IP. 
 
Второй способ — это использовать специальные программы. Об одной из них и пойдет речь в следующей главе. 
 
Перенаправление трафика в Tallow 
Tallow (TorWall) — прозрачный брандмауэр Tor и прокси-решение для Windows. Вкратце, когда вы запустите Тэлоу: 
 
Весь трафик с вашего ПК прозрачно перенаправляется через сеть анонимности Tor. Программу не нужно настраивать для использования Tor. 
Все не связанные с Tor-трафик, такие как UDP, блокируются. Сюда входит и DNS-трафик, который помогает уменьшить утечки. 
У Tallow есть несколько преимуществ: 
 
Во-первых, весь не Tor трафик блокируется и не может покинуть ваш компьютер. Это защищает от некоторых уязвимостей, таких как «утечка DNS». 
 
Во-вторых, Tallow прозрачен. Это означает, что ваши приложения и программы не будут знать, что трафик перенаправляется через Tor.

Поэтому вы можете использовать свой предпочтительный веб-браузер или любую другую программу, которая подключается через Интернет, с нулевой конфигурацией. 
 
Но будьте осторожны! В отличие от Tor Browser Bundle, Tallow не анонимизирует контент, отправленный через сеть Tor. Например куки или другая информация, которая может идентифицировать вас. 
 
Скачать Tallow 
Сначала загрузите Tallow. Скачать приложение можно с официального сайта по этой прямой ссылке. Программа имеет две версии: обычную и портабельную (версия которая не требует установки). 
 
Работает на операционных системах: Windows Vista, Windows 7, Windows 8, Windows 10, MacOSX, Linux. 
 
Также программу можно скачать с репозитория на GitHub: 
 
Установка Tallow 
С установкой на Windows все просто. Просто запускаете файл и дождитесь конца установки. 
 
Использование Tallow 
Использовать Tallow также просто как и устанавливать. Нажмите большую кнопку «Tor», чтобы начать перенаправление трафика через сеть Tor. 
 
Создать карусель Tallow Добавьте описание 
 
Нажмите кнопку «Tor» еще раз, чтобы остановить работу Тэлоу и вернуть подключение к Интернету, в прежнее состояние. 
 
Имейте ввиду во время включения и отключения программы подключения к сети будет прерываться! 
 
Настройка Tallow 
Как вы видите на скрине. В программе имеется две настройки: 
 
Force web-only — блокирует весь трафик, не относящийся к сети (порт HTTP 80, HTTPS-порт 443) 
Force SOCKS4a — блокирует прямые подключения к IP-адресам через Tor. 
Дополнительные настройки Tallow 
Для продвинутых пользователей есть возможность изменить некоторые настройки редактируя разные файлы. Например: 
 
Используя командную строку можете настроить вывод отладки запустив файл tallow.exe. 
Изменив файл hosts.deny, вы сможете изменить домены которые блокируются через Tor. 
Отредактировав файл traffic.deny, контролировать, какие типы трафика блокируются через Tor. 
Изменив файл torrc для настройки Tor. 
Заменив файл tor.exe на обновить версию. 
Т,Е у нас теперь весь трафик ебашит через Tor (Enternet-PC-TOR-Resource), вроде ты уже ебать анонимный, но всю эту поебень ментам легко обойти и харкануть те в личико, т.к могут быть трекеры с обратной стороны, и простым сопоставлением тебя найдут и разобьют ебало 
Что-бы решить эту проблему, достаточно гнать траф через 3 сторону, и мы заюзаем ахуенный впн Mullvad - https://mullvad.net/ru/  
Стоит эта поебота 5 бачей, что для обычного русского - дохуя, но его можно юзать на 3 устройствах, следовательно, и скидыватся в 3 ебала. 
Просто качаешь, покупаешь, получаешь ключ, вводишь ключ, и развлекаешься. 
Теперь у нас трафик идет PC-TOR-VPN-RESOURCE, что уже блатняк, и разомкнуть такую цепочку будет дорого и нудно, но мы в рот ебали и лучше спараноить, чем потом жалеть. 
Просто юзай за основу браузера для своих темных делишек тор, а в телеграме пропускай трафик через Tor, в итоге у нас выходит такая цепь ебанная PC-Tor-VPN-Tor просто 10/10 не найдут и не отпиздят. 
Как пропускать траф в телеге через тор писал мой знакомый пидараска - https://vk.com/@sterbentodd-delaem-telegram-anonimnee . 
А, ну и еще, если ты уже допускал бреши в анонимности, то ты пиздуешь переустанавливать винду и выполнять все пункты сверху, если ты хочешь добится своей желанной анонимности на винде.Т.к я уверен, что у тебя остались бреши ввиде реальных данных, заходов с твоего айпи, дохуя+ аккаунтов и паролей, т.д.



III BOTS

@scugotityc24552925bot - Глаз бога. Интересный бот, если ваш соперник бесполезное животное без анонимности, то вам сюда.

@HimeraSearchBot - Химера. Интересный бот, но платный. Можете закинуть хоть рублей 200, указав пункт по которому будет пробиваться ваш соперник, и большой шанс выдачи практически всего деанона буквально за 100 рублей.

@Smart_SearchBot - Бот который с помощью фотографии может найти информации о том или ином человеке.

Поиск фотографии в социальных сетях

https://vk.watch/
https://findclone.ru/
https://pimeyes.com/en/
https://search4faces.com/ 

@cryptoscanning_bot 
@protestchat_bot 
@joinchatru_bot 
@deanonym_bot 
@GetCont_bot 
@Checnum_bot 
@EyeGoodBot 
@Tpoisk_Bot 
@LBSE_bot

@MyGenisBot — находит имя и фамилию владельца номера
account.lampyre.io— программа выполняет поиск аккаунтов, паролей и многих других данных
@usersbox_bot — бот найдет аккаунты в ВК у которых в поле номера телефона указан искомый номер
@GetPhone_bot — вытаскивает номера телефона из утекших баз
@clerkinfobot — берет данные из приложения getcontact, показывает как записан номер телефона в контактах
@GetFb_bot — дает ссылку на Facebook аккаунт


Поиск по EMAIL

intelx.io — многофункциональный поисковик, поиск осуществляется еще и по даркнету
@mailsearchbot — ищет по базе, дает часть пароля
@info_baza_bot — покажет из какой базы слита почта, 2 бесплатных скана
eakedsource.ru — покажет в каких базах слита почта
mostwantedhf.info — найдет аккаунт skype
email2phonenumber (https://github.com/martinvigo/email2phonenumber) (t) — автоматически собирает данные со страниц восстановления аккаунта, и находит номер телефона
spiderfoot.net (r) — автоматический поиск с использованием огромного количества методов, можно использовать в облаке если пройти регистрацию
eversegenie.com — найдет местоположение, Первую букву имени и номера телефонов
@last4mailbot — бот найдет последние 4 цифры номера телефона клиента Сбербанка
searchmy.bio — найдет учетную запись Instagram с электронной почтой в описании
leakprobe.net — найдет ник и источник слитой базы 
recon.secapps.com — автоматический поиск и создание карт взаимосвязей
@AvinfoBot — найдет аккаунт в ВК
• Содержание:
1. Поиск по аккаунту VK.
2. Поиск по аккаунту TELEGRAM.
3. Поиск по аккаунту OK.RU.
4. Поиск по аккаунту TIKTOK.
5. Поиск по аккаунту YOUTUBE.
6. Поиск по аккаунту INSTAGRAM.
7. Поиск по аккаунту FACEBOOK.
8. Поиск по аккаунту DISCORD.
9. Поиск по аккаунту TWITTER.
10. Поиск по ПОЧТЕ.
11. Поиск по НОМЕРУ ТЕЛЕФОНА.
12. Поиск по НОМЕРУ ТЕЛЕФОНА РОССИИ.
13. Поиск по НОМЕРУ ТЕЛЕФОНА УКРАИНЫ.
14. Поиск по НОМЕРУ ТЕЛЕФОНА КАЗАХСТАНА.
15. Поиск по ФИО
16. Поиск по ФИО РОССИИ.
17. Поиск по ФИО КАЗАХСТАНА.
18. Поиск по ФИО УКРАИНЫ.
19. Поиск по IMEI.
20. Поиск по СЕРИЙНОМУ НОМЕРУ.
21. Поиск по WI-FI.
22. Поиск по ФОТОГРАФИИ.
23. Поиск по IP-АДРЕСУ.
24. Поиск по ФИЗИЧЕСКОМУ АДРЕСУ.

Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х

1. Поиск по аккаунту VK.
[!] Содержимое раздела:

• https://searchlikes.ru — найдет где есть лайки и комментарии пользователя, дает статистику друзей
• http://ininterests.com/%D0%9B%D1%8E%D0%B4%D0%B8 — архивная копия аккаунта несколько лет назад
• https://new.220vk.com — определит средний возраст друзей, скрытых друзей, города друзей, дата регистрации и т.д
• https://vk5.city4me.com — cтатистика онлайн активности, скрытые друзья
• https://github.com/migalin/VKAnalysis — анализ круга общения, текста, фото, активности и интересов аккаунта
• https://cipher387.github.io/quickcacheandarchivesearch/ — покажет архивированную версию аккаунта, даст 20+ прямых ссылок на сайты веб архивы
• https://vk.com/app7183114 — найдет созданные группы, упоминания в комментариях, общих друзей, созданные приложения и комментарии к фото
• https://t.me/InfoVkUser_bot — бот покажет наиболее частые места учебы друзей аккаунта
• https://t.me/FindNameVk_bot — история изменений имени аккаунта
• https://vkdia.com — определит с кем из друзей переписывается человек
• https://глазбога.com — бот, найдет фото приватного аккаунта в хорошем качестве, дату создания
• https://vkpt.info — мониторинг деятельности пользователя, поиск старых друзей, покажет, кому ставит лайки, все комментарии пользователя, скрытые друзья
• https://UsersBox.org — бот, находит номер телефона и много других полезных данных, бесплатный триал 14 дней
• https://t.me/SovaAppBot — статистика друзей аккаунта, покажет выборку по городу, стране, возрасту и полу
• https://smartsearchbot.com — бот, находит email, номер телефона и другое, бесплатный поиск не доступен для новых пользователей
• https://vk.com/dev/messages.getLastActivity — покажет дату последней активности аккаунта
• https://t.me/Informator_BelBot — найдёт частые города друзей, общих друзей между двумя аккаунтами
• https://vk.com/app3256362 — приложение ВК, найдет скрытых друзей, дождитесь окончания поиска
• https://t.me/QuickOSINT_Robot — найдет пароли, соц. сети, логины, телефоны, сделает анализ друзей и многое другое, всего 3 бесплатных запроса для новых аккаунтов
• https://t.me/UniversalSearchRobot — найдет аккаунт на Мой Мир, дату изменения, создания и дату последнего статуса онлайн, архивные копии профиля, упоминание профиля в ВК и прочее
• https://t.me/OffThisContactBot — найдет номер телефона, почту, имя, фото, для поиска создай и подключи свой тг-бот
• https://t.me/Zernerda_bot — анализ друзей и знакомых по городу, возрасту, школе, ВУЗу, лайкам, ищет упоминание профиля в утечках, бесплатный поиск после первого запуска бота
• https://t.me/a11_1n_bot (r) — найдет почту и номер телефона
• https://t.me/declassified_bot — найдет адреса регистрации, почту, имя и авто
• https://t.me/vk2017robot — профиль вк в 2017 году, покажет аватар, описание и прочее
• https://t.me/VKHistoryRobot — история профиля с 2010 по 2021 год, есть даже аватары, вводить числовой ID страницы
• https://t.me/vkanalys_bot — даст статистику по городам и учебным заведениям друзей, найдет страницы с тем же именем
• https://t.me/data_surf_bot — ищет в утечках, выдает адреса имена, почты и прочее, одна бесплатная попытка на аккаунт
• https://onli-vk.ru/pivatfriends.php?id=123456789 — Поиск друзей закрытого аккаунта, замените 123456789 на ID аккаунта VK
• https://vk.com/feed?obj=123456789&q=&section=mentions — Упоминания аккаунта, замените 123456789 на ID аккаунта
• https://rusfinder.pro/vk/user/id123456789 — Сохраненная копия профиля: имя и город профиля в заголовке страницы, замените 123456789 на ID аккаунта VK
• https://my.mail.ru/vk/123456789 — Найдет аккаунт на Мой Мир, замените 123456789 в ссылке на ID аккаунта
• https://vk.com/foaf.php?id=123456789 — Найдет количество друзей, количество подписчиков и дату рождения, дату изменения имени и прочее, замените 123456789 в ссылке на ID аккаунта, откройте исходный код страницы Ctrl+U
• https://topdb.ru/username — Найдет архивную копию профиля и фото, иногда нужен VPN, замените username на логин пользователя или ID, например id1234567
• https://bigbookname.com/user/id-123456789 — Историческая копия аккаунта с фото, друзьями, датой рождения, городом и информацией о себе, замените 123456789 на ID аккаунта VK

Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х

2. Поиск по аккаунту TELEGRAM.
[!] Содержимое раздела:

• https://t.me/usinfobot — по ID найдёт имя и ссылку аккаунта, работает в inline режиме, введите в поле ввода сообщения @usinfobot и Telegram ID
• https://cipher387.github.io/quickcacheandarchivesearch/ — покажет архивированную страницу, даст 20+ прямых ссылок на сайты веб архивы, поиск по ссылке на аккаунт
• https://t.me/SangMataInfo_bot — история изменения имени аккаунта
• https://t.me/TeleSINT_Bot — найдет группы в которых состоит пользователь
• https://t.me/creationdatebot — примерная дата создания аккаунта, бот принимает username, для поиска по ID можно переслать сообщение от искомого пользователя
• https://t.me/MySeekerBot — поисковик по иранским каналам
• https://github.com/Forichok/TelegramOnlineSpy — лог онлайн активности аккаунта, скажет когда был в сети
• https://t.me/UniversalSearchRobot — по ID найдёт адреса почты, статус бана ботом ComBot, число блокировок, заблокированные сообщения, архивное имя и аватар аккаунта
• https://smartsearchbot.com — бот находит ФИО, бесплатный поиск не доступен для новых пользователей
• https://t.me/kruglyashik — канал с базой из 500K круглых видео-сообщений из русскоязычных групп, в поиске по каналу введите имя пользователя или #ID123456789 где 123456789  ID аккаунта
• https://t.me/TgAnalyst_bot — находит номер телефона, старое имя аккаунта, логин, IP и устройство, местами могут быть ложные данные, первый поиск без регистрации, если её пройти, то сливается ваш номер телефона
• https://ГлазБога.com — найдет часть номера телефона, историю изменения ссылки аккаунта
• https://t.me/clerkinfobot — дает номер телефона
• https://UsersBox.org — бот, по нику найдет номер телефона, бесплатный доступ 14 дней после первого запуска бота
• https://t.me/TuriBot — выдает по ID имя пользователя аккаунта Telegram, отправь боту команду /resolve + ID
• https://t.me/eyeofbeholder_bot — даёт интересы аккаунта, а платно выдаст историю изменения имени, номер телефона, группы и ссылки которые публиковал пользователь
• https://t.me/regdatebot — выдаст примерную дату регистрации аккаунта, отправьте боту числовой ID аккаунта или перешлите сообщение
• https://t.me/QuickOSINT_Robot — найдет номер телефона, группы, id и ссылку аккаунта, поиск по нику или ID аккаунта, всего 3 бесплатных запроса для новых аккаунтов
• https://t.me/ki_wibot — найдет номер телефона в иранской утечке Telegram
• https://app.element.io/#/home — найдет сохранённую копию аккаунта по ID, это аватарка  и имя, после регистрации, нажми на +, и выбери "начать новый чат", введи id в поиск
• https://t.me/OffThisContactBot — найдет номер телефона, почту, имя, для поиска создай и подключи свой тг-бот
• https://t.me/Zernerda_bot — по ID находит телефон и ник аккаунта Telegram, бесплатный поиск после первого запуска бота
• https://t.me/declassified_bot — выдаст имена, телефон и почту
• https://telescan-group.ru — бот, найдет группы в которых состоял пользователь, историю изменения имени, номер телефона
• https://etlgr.me/conversations/123456789/subscription — найдет сохраненное имя аккаунта и статус подписки на @etlgr_bot, можно подставить к ID @etlgr.com и получить Email адрес, замени в ссылке 123456789 на ID аккаунта

Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х

3. Поиск по аккаунту OK.RU.
[!] Содержимое раздела:

• https://ok.city4me.com — cтатистика онлайн активности, можно узнать когда был онлайн, с какого устройства, узнать с кем из друзей был онлайн, кого добавляет в друзья или удаляет из друзей, дата регистрации пользователя
• https://cipher387.github.io/quickcacheandarchivesearch/ — покажет архивированную страницу, даст 20+ прямых ссылок на сайты веб архивы, поиск по ссылке на аккаунт
• https://github.com/soxoj/socid_extractor — найдет user ID
• https://m.ok.ru/dk?st.cmd=accountRecoverFeedbackForm — показывает часть номера телефона, email, фамилии и полностью город с датой регистрации, используй во вкладке инкогнито
• https://t.me/UniversalSearchRobot — найдет профиль на mailru, дату регистрации, даст ссылки на поисковики
• https://t.me/detectiva_robot — находит часть номера телефона, дату регистрации
• https://t.me/Zernerda_bot — анализирует друзей: популярные фамилии друзей, их города, может найти телефон
• https://my.mail.ru/ok/123456789 — найдет аккаунт на Мой Мир, замените 123456789 в ссылке на ID аккаунта

Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х

4. Поиск по аккаунту TIKTOK.
[!] Содержимое раздела:

• https://app.tikbuddy.com — слежка за аккаунтом, покажет статистику по лайкам, просмотрам, популярности, облако слов из комментарий, поиск в комментариях и другое
• https://cipher387.github.io/quickcacheandarchivesearch/ — покажет архивированную страницу, даст 20+ прямых ссылок на сайты веб архивы, поиск по ссылке на аккаунт
• https://t.me/OSINTiktok_bot — покажет время и дату создания профиля, картинку профиля и прочее
• https://brainans.com — покажет видео профиля, даст скачать его в лучшем качестве, показывает комментарии
• https://github.com/drawrowfly/tiktok-scraper — без входа скачает все видео аккаунта в лучшем качестве и с метаданными
• https://t.me/AximoBot — мгновенно сохранит новые публикации аккаунта и отправит в Telegram

Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х

5. Поиск по аккаунту YOUTUBE.
[!] Содержимое раздела:

• https://keyhole.co — анализ аккаунта, при регистрации нет проверок по email и телефону, вводите любые данные, 7 дней бесплатно
• https://cipher387.github.io/quickcacheandarchivesearch/ — покажет архивированную страницу, даст 20+ прямых ссылок на сайты веб архивы, поиск по ссылке на канал
• https://ytch.ru — история изменения имени канала, не все есть
• https://mattw.io/youtube-metadata/ — точная дата создания канала
• https://unlistedvideos.com — найдет unlisted видео канала
• https://mattw.io/youtube-metadata/bulk — скачает все видео канала, найдет в видео гео, теги, приватные ролики, ссылки, построит таблицу частоты загрузки видео и прочее
• https://ytcomment.kmcat.uk — позволяет искать комментарии к видео по всему каналу
• https://tools.digitalmethods.net/netvizz/youtube/mod_channel_info.php — дает ID, ссылки на аватарки, описание, название, количество подписчиков и просмотров
• https://tools.digitalmethods.net/netvizz/youtube/mod_videos_list.php — экспортирует все видео с канала в файл где есть описания, ссылки на обложки, даты загрузки и др.
• https://web.archive.org/web/*/plus.google.com/+CHANNEL_NAME* — найдет профиль в закрытом сервисе Google Plus, замените CHANNEL_NAME на имя канала на латинице
• https://www.altcensored.com/channel/ID — сохраненная копия канала, замените ID на ID канала, сайт может не работать в какой-то стране
• https://t.me/AximoBot — мгновенно сохранит новые публикации аккаунта в Telegram

Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х

6. Поиск по аккаунту INSTAGRAM.
[!] Содержимое раздела:

• https://tools.codeofaninja.com/find-instagram-user-id — определит ID аккаунта
• https://sometag.org — аналитика аккаунта
• https://keyhole.co — анализ аккаунта, при регистрации нет проверок по email и телефону, вводите любые данные, 7 дней бесплатно
• https://cipher387.github.io/quickcacheandarchivesearch/ — покажет архивированную страницу, даст 20+ прямых ссылок на сайты веб архивы, поиск по ссылке на аккаунт
• https://UsersBox.org — бот, найдет аккаунты в ВК у которых в поле Instagram указан искомый логин, введите в боте  instagram: <логин>
• https://undelete.news/ — сохраняет удаленные истории и фото, если нет аккаунта просто добавьте его на сайт для слежки за ним
• https://глазбога.com — бот, дает часть номера телефона
• https://smartsearchbot.com — бот находит email, номер телефона и другое, бесплатный поиск не доступен для новых пользователей
• https://www.notjustanalytics.com/ — анализ аккаунта, покажет вовлеченность, рост количества подписчиков, графики взаимодействий и другое
• https://github.com/novitae/sterraxcyl — найдёт ближний круг аккаунта, сравнивает списки подписок и подписчиков у аккаунта и находит совпадения
• https://t.me/QuickOSINT_Robot — найдет соц. сети, логины, телефоны, адрес и многое другое, всего 3 бесплатных запроса для новых аккаунтов
• https://github.com/novitae/Tenai — найдет часть подписчиков приватного аккаунта
• https://dumpor.com — кэш аккаунта, если профиль был публичным но стал недавно закрытым, то сайт может показать фото и подписки аккаунта из кеша
• https://github.com/megadose/toutatis — достанет публичные данные аккаунта, это id, имя, бизнес контакты, телефон и почту из восстановления доступа без уведомления самого пользователя
• https://trendhero.io — статистика аккаунта, уровень вовлечённости аудитории и прочее
• https://t.me/detectiva_robot — вытаскивает часть номера телефона
• https://chrome.google.com/webstore/detail/insfo-export-instagram-fo/bckleejkdhlponanidmjfjdigpahlado/related — расширение для Chrome, скачивает всех подписчиков и подписки аккаунта
• https://stevesie.com/cloud/apis/instagram/public-user-posts — соберет все посты профиля и даст ссылки на фото
• https://picuki.com — дает скачать истории, фото и просмотреть профиль без входа
• https://pixwox.com — дает скачать истории, IGTV, фото, просмотреть комментарии без регистрации и входа
• https://storiesdown.com — дает скачать истории, фото без регистрации и входа
• https://t.me/instagent_bot — скачивает посты, истории, igtv, коллекции
• https://github.com/Datalux/Osintgram — скачает все фото, сторис, комментарии, подписчиков, профили подписок, может достать телефоны, почты подписчиков и прочее
• https://t.me/AximoBot — мгновенно сохранит новые публикации аккаунта в Telegram
• https://t.me/Instagram_Watcher_Bot — следит за новыми историями аккаунта Instagram
• https://www.instagram.com/example/?__a=1&__d=1 — страница в формате JSON, замените example на username аккаунта, покажет id, ссылки на фото и прочее. Работает если вы вошли в свой аккаунт в Instagram

Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х

7. Поиск по аккаунту FACEBOOK.
[!] Содержимое раздела:

• https://lookup-id.com — находит числовой ID аккаунта
• https://graph.tips/beta/ — дает возможность просматривать, каким публикациям ставил лайки пользователь
• https://www.whopostedwhat.com/ — найдет посты в Facebook
• https://github.com/sqren/fb-sleep-stats — отслеживает онлайн / оффлайн статус людей, можно получить точную информацию о времени их сна 
• https://keyhole.co — анализ аккаунта, при регистрации нет проверок по email и телефону, вводите любые данные
• https://cipher387.github.io/quickcacheandarchivesearch/ — покажет архивированную страницу, даст 20+ прямых ссылок на сайты веб архивы, поиск по ссылке на аккаунт
• https://UsersBox.org — бот, найдет аккаунты в ВК у которых в поле Facebook указан искомый логин, введите в боте facebook: <логин>
• https://github.com/sowdust/ffff — частично реконструирует скрытых друзей, используя функциональность "общие друзья". Требуется знать хотя бы другую учетную запись, имеющую хотя бы одного общего друга с целью
• https://smartsearchbot.com — находит email, номер телефона и другое, бесплатный поиск не доступен для новых пользователей
• https://t.me/getfb_bot — найдет номер телефона
• https://t.me/QuickOSINT_Robot — найдет соц. сети, логины, телефоны, адрес и многое другое, всего 3 бесплатных запроса для новых аккаунтов
• https://app.element.io/#/home — найдет сохранённую копию аккаунта по ID, это имя и аватарка, после регистрации, нажми на +, и выбери "начать новый чат", введи id в поиск
• http://4wbwa6vcpvcr3vvf4qkhppgy56urmjcj2vagu2iqgp3z656xcmfdbiqd.onion.ws/ — найдет номер телефона аккаунта Facebook в глобальной утечке, нужно пройти капчу перед поиском
• https://t.me/Zernerda_bot — ищет в слитых базах, находит телефон, имя аккаунта и прочее, бесплатный поиск после первого запуска бота
• https://t.me/a11_1n_bot — найдет имя и номер телефона
• https://t.me/declassified_bot — найдет телефон, имена, адреса, аккаунт telegram
• https://t.me/detectiva_robot — вытаскивает часть номера телефона
• https://www.facebook.com/browse/fanned_pages/?id=USERID — найдет лайки пользователя, замените USERID на ID аккаунта
• https://facebook.com/friendship/USERID/USERID — будут отображаться общие друзья, общие записи и фотографии, а также любые другие связанные данные, такие как родные города, школы и т. д., замените USERID на ID аккаунта
• https://facebook.com/browse/mutual_friends/?uid=USERID&node=USERID — найдет общих друзей, которые имеют общедоступные списки друзей, если у одного из искомых пользователей есть общедоступный список друзей, замените USERID на ID аккаунта
• https://my.mail.ru/fb/USERID — найдет аккаунт на Мой Мир, замените USERID в ссылке на ID аккаунта
• https://sowsearch.info — есть фильтр по дате, группе, и локации, можно найти посты пользователя, фото
• https://phantombuster.com/automations/facebook/8369/facebook-profile-scraper — скачает всю публичную информацию аккаунта

Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х

8. Поиск по аккаунту DISCORD.
[!] Содержимое раздела:

• https://support.discord.com/hc/ru/articles/206346498-Where-can-I-find-my-User-Server-Message-ID — инструкция как найти Discord ID аккаунта
• https://discord.id — показывает дату создания и фото
• https://discordhub.com/user/search — находит сервера
• https://discordleaks.unicornriot.ninja/discord/users — находит сервера и сообщения
• https://hugo.moe/discord/discord-id-creation-date.html — показывает дату создания аккаунта
• https://app.element.io/#/home — найдет сохранённую копию аккаунта по ID, это имя и аватар, после регистрации, нажми на +, и выбери "начать новый чат", введи id в поиск
• https://discord-tracker.ru — выдает дату регистрации, статистику активности, сервера в которых учувствует аккаунт, история имени, история аватара, события в голосовом, сообщения, популярные слова, возможные друзья, статистика активности, и прочее
• https://t.me/UniversalSearchRobot — по Discord ID или тегу аккаунта найдет профили Discord на сторонних ресурсах
• https://top.gg/user/1234567890987654321 — находит в каких серверах состоит, фото, описание профиля, и прочее, замени 1234567890987654321 на Discord ID аккаунта|

Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х

9. Поиск по аккаунту TWITTER.
[!] Содержимое раздела:

• https://tweeterid.com — по адресу аккаунта найдет ID аккаунта
• https://followerwonk.com — полный анализ аккаунта по подпискам или подписчикам
• https://sleepingtime.org — определяет примерное время сна аккаунта
• https://foller.me — аналитика аккаунта, покажет топ употребляемых слов, сайтов, время твитов, упоминания
• https://socialbearing.com — аналитика аккаунта по постам, большой акцент на топ частых слов, хэштегов, доменов и ссылок
• https://keyhole.co — анализ аккаунта, при регистрации нет проверок по email и телефону, вводите любые данные, 7 дней бесплатно
• https://analytics.mentionmapp.com — покажет взаимосвязи между аккаунтами и их частоту ещё и связи с хэштегами
• http://keitharm.me/projects/tweet/ — проанализирует все твитты аккаунта и покажет все указанные гео-позиции на карте
• http://followerwonk.com/compare/ — сравнит подписчиков аккаунта с другим профилем и покажет сколько из них общих
• https://https://github.com/soxoj/socid_extractor — найдет user ID
• https://UsersBox.org — бот, найдет аккаунты в ВК у которых в поле twitter указан искомый логин, введите в боте  twitter: <логин>
• https://undelete.news/ — сохраняет твитты, если нет аккаунта просто добавьте его на сайт для слежки за ним
• https://makeadverbsgreatagain.org/allegedly/ — анализ твиттов пользователя за последние 2 месяца, составление графика с временем публикаций и частотой
• https://tweetbeaver.com — найдет взаимосвязь и общих подписчиков между 2 аккаунтами, ID по username и наоборот
• https://smartsearchbot.com — бот  находит email, номер телефона и другое, бесплатный поиск не доступен для новых пользователей
• https://tweettopicexplorer.neoformix.com — статистика наиболее употребляемых слов из твиттов пользователя
• https://www.twitteraudit.com — покажет количество настоящих и фальшивых подписчиков аккаунта
• https://app.truthnest.com — статистика еженедельной активности, часы пик, частота публикации, популярные твиты, хэштеги, упомянутые пользователи, пользователи, получившие ретвиты, типы и содержание твитов, упомянутые сайты, языки, инструменты публикации, активность подписчика и прочее
• https://cipher387.github.io/quickcacheandarchivesearch/ — покажет архивированную страницу, даст 20+ прямых ссылок на сайты веб архивы, поиск по ссылке на аккаунт
• https://twiangulate.com/search/ — поиск общих подписчиков и подписок между двумя аккаунтами, а также сравнит их охват по подписчикам
• https://t.me/QuickOSINT_Robot — найдет соц. сети, логины, телефоны, адрес и многое другое, всего 3 бесплатных запроса для новых аккаунтов
• https://app.element.io/#/home — найдет сохранённую копию аккаунта по ID, это имя и аватар, после регистрации, нажми на +, и выбери "начать новый чат", введи id в поиск
• https://tinfoleak.com — найдет в твитах утечки адресов, устройств, профилей, и прочего, составит статистику
• https://t.me/Zernerda_bot — ищет в слитых базах, находит почту, имя, аватар и прочие детали аккаунта
• https://twitter.com/intent/user?user_id=123456789 — найдет аккаунт в Twitter по ID, замените 123456789
• https://spoonbill.io/twitter/data/USERNAME/ — история изменения имени, био и прочих данных профиля, замените USERNAME на имя пользователя
• https://www.politwoops.com/p/*/USERNAME — удаленные твитты, работает с политиками, замените USERNAME на имя пользователя
• https://web.archive.org/web/*/twitter.com/12345789/* — найдет архив твитов, замените 12356789 на ID аккаунта или на имя пользователя
• https://lamentandotweets.com/USERNAME — найдет удалённые твиты, больше испанских аккаунтов, замените USERNAME на имя пользователя
• https://memory.lol/tw/USERNAME — найдет историю изменения имени профиля, заменить USERNAME на имя пользователя twitter
• https://spoonbill.io — следит за изменениями имени, био, ссылками аккаунта, на него нужно подписаться в Twitter
• https://nitter.domain.glass — просмотр профиля без регистрации
• https://t.me/AximoBot — мгновенно сохранит новые публикации аккаунта в Telegram
• https://twiangulate.com/search/ — поиск  по любым данным в друзьях пользователя
• https://phantombuster.com/automations/twitter/4130/twitter-follower-collector — скачает всех подписчиков аккаунта
• https://tweetbeaver.com — скачает всех подписчиков, друзей, любимые посты и все историю аккаунта
• https://www.vicinitas.io/free-tools/download-twitter-followers — скачает подписчиков аккаунта с подробной информацией о каждом
• https://exportcomments.com/export-twitter-followers — скачает аккаунты на которые подписан пользователь

Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х

10. Поиск по ПОЧТЕ.
[!] Содержимое раздела:

• https://haveibeenpwned.com — проверка почты в слитых базах
• https://emailrep.io — найдет на каких сайтах был зарегистрирован аккаунт использующий определенную почту
• https://dehashed.com — проверка почты в слитых базах
• https://intelx.io — находит упоминание почты в архиве утечек, Tor, I2P и в крупных базах
• https://t.me/OTcIa6RB_InfoB_Bot — клон ИнфоБазы, бесплатно найдет часть ФИО и телефона гражданина Украины
• https://leakedsource.ru — покажет в каких базах слита почта
• https://mostwantedhf.info — найдет аккаунт skype
• https://github.com/martinvigo/email2phonenumber — автоматически собирает данные со страниц восстановления аккаунта, и находит номер телефона
• https://spiderfoot.net — автоматический поиск с использованием огромного количества методов, можно использовать в облаке если пройти регистрацию
• https://t.me/last4mailbot — бот найдет последние 4 цифры номера телефона клиента Сбербанка
• https://avclick.me/v/AVinfoBot — найдет аккаунт в ВК
• https://identificator.space/search — найдет аккаунт Skype, Duolingo, Google, где регистрирован, авторизация без подтверждения
• https://ГлазБога.com — найдет фото из аккаунтов пользователя 
• https://www.cyberbackgroundchecks.com/email — найдет все данные гражданина США, вход на сайт разрешен только с IP адреса США
• https://github.com/megadose/holehe — инструмент проверяет аккаунты каких сайтов зарегистрированы на искомый email адрес, поиск по 30 источникам
• https://tools.epieos.com — найдет Google ID, даст ссылки на профиль в Google карты, альбомы и календарь, найдет к каким сайтам привязана почта, профиль LinkedIn
• https://t.me/UniversalSearchRobot — найдет профили на Яндекс, в сервисах Google, утекшие пароли, социальные сети, адрес регистрации, номер телефона, био, Gmail адрес и прочее
• https://rocketreach.co — выдает имя, профили в социальных сетях, почты, часть телефона, и прочее
• https://m.ok.ru/dk?st.cmd=accountRecoverFeedbackForm — показывает часть номера телефона, email, фамилии и полностью город с датой регистрации, используй во вкладке инкогнито
• https://avatarapi.com — найдет аватарку из множества источников
• https://t.me/SovaAppBot — найдет к каким сайтам привязана почта, результаты могут отличаться от аналогичных инструментов
• https://www.vedbex.com/tools/email2skype — найдет аккаунт Skype
• https://odyssey-search.info — персональные данные гражданина России, Украины, автомобили, документы, аккаунты с социальных сетях, зарегистрироваться можно на имя любой существующий компании
• https://tools.whoisxmlapi.com/reverse-whois-search#captcha=0329976453 — найдет домены сайтов, поиск в истории whois
• https://t.me/LeakCheckBot — покажет на каких сайтах утекли пароли
• https://t.me/a11_1n_bot — выдаст ссылку на профиль Facebook
• https://aihitdata.com — ищет почту в контактах компаний по всему миру, откройте на сайте вкладку “More Fields”
• https://www.melissa.com/v2/lookups/personator — найдет ФИО, дату рождения, адрес проживания, этнос и прочее гражданина США
• https://leak-lookup.com/search — покажет на каких сайтах была утечка с искомым email
• https://www.whoxy.com/reverse-whois/ — найдет домены сайтов, поиск в истории whois
• https://smartsearchbot.com — бот выдает ФИО, дату рождения, адрес, телефон и прочее, бесплатный поиск не доступен для новых пользователей
• https://en.gravatar.com/site/check/ — выдает аватарку аккаунта Gravatar
• https://xjypo5vzgmo7jca6b322dnqbsdnp3amd24ybx26x5nxbusccjkm4pwid.onion.ws/deepsearch —  найдет логин, пароль, источник утечки
• https://spydialer.com — находит имя владельца почты
• https://t.me/ce_poshuk_bot — найдет ФИО, дату рождения, телефоны гражданина Украины
• https://UsersBox.org — бот, найдет аккаунты, пароли, почты, имена, бесплатно 14 дней для новых аккаунтов
• https://t.me/QuickOSINT_Robot — найдет пароли, соц. сети, логины, телефоны и многое другое, всего 3 бесплатных запроса для новых аккаунтов
• https://x-ray.contact/ru-search — поиск в русском сегменте утечек, найдет номер телефона, социальные сети, больше адресов почт, вход из России запрещён, нужен VPN
• https://community.riskiq.com — найдет сайты и домены у которых в whois искомый email адрес
• https://t.me/OffThisContactBot — поиск в утечках, ищет имена, адреса, иелефоны, большая база, бесплатно подключите свой бот
• https://2ip.ru/domain-list-by-email/ — найдет доменные имена сайтов, в whois которых, есть запись с искомым email адресом
• https://t.me/n3fm4xw2rwbot — найдет возможные имена, адрес, email, телефоны, ВК, пароли, авто
• https://t.me/GetOK2bot — найдет профиль в Одноклассниках и даст ссылку на него
• https://data.intelx.io/saverudata/ — покажет из утечек полный адрес, имя, все из сервиса Яндекс Еда, СДЕК, аккаунт ВК, траты на еду за 6 месяцев
• https://t.me/Zernerda_bot — ищет в двухсот слитых базах, находит адреса, имена, аккаунты и много другого, бесплатный поиск после первого запуска бота
• https://t.me/declassified_bot — телефон, имена, возможные пароли
• https://scamsearch.io/#/search.php?f=1&hover_cle=yes&fill=0329976453&type=full-search — реестр мошенников, найдет bitcoin адрес, причину внесения в реестр, номер телефона, дату и прочее
• https://seon.io — найдет аккаунты LinkedIn, Skype, Foursquare, проверит где зарегистрирован, в каких утечках замечена почта
• https://t.me/safe_search_bot — в утечках находит адреса, телефоны, почты
• https://t.me/PasswordSearchBot — выдает пароли
• https://t.me/t_sys_test_bot — найдет прописку, штрафы, авто, почты, дату рождения. документы, авиабилеты и прочее, бесплатный поиск 24 часа после первого запуска бота
• https://t.me/data_surf_bot — ищет в утечках, выдает адреса имена, почты и прочее, одна бесплатная попытка на аккаунт
• https://my.mail.ru/SITE/LOGIN — поиск аккаунта на Мой Мир, замените LOGIN на email адрес без @SITE.COM а SITE на тот сайт который указан в email адресе после "@". Например из maria@web.de в https://my.mail.ru/web.de/maria/
• https://filin.mail.ru/pic?email=LOGIN@site.com — картинка аккаунта на mail.ru, замените LOGIN@site.com на email адрес
• https://myspace.com/search/people?q=LOGIN@site.com — аккаунт на MySpace, любой аккаунт может привязать любую почту без подтверждения, замените LOGIN@site.com на email адрес

Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х

11. Поиск по НОМЕРУ ТЕЛЕФОНА.
[!] Содержимое раздела:

• https://demo.phoneinfoga.crvx.fr/#/ — определят тип номера, город, дает дорки Google
• https://numberway.com — найдет телефонный справочник
• https://UsersBox.org — бот, найдет аккаунты, пароли, почты, имена, бесплатный период 14 дней для новых аккаунтов
• https://t.me/GetFb_bot — находит аккаунт Facebook
• https://smsc.ru/testhlr/ — статус активности телефона
• https://github.com/megadose/ignorant — находит к какому сайту привязан номер телефона
• https://t.me/clerkinfobot — находит объявления и как записан номер телефона в контактах, берет данные из приложения getcontact
• https://tools.whoisxmlapi.com/reverse-whois-search — выявляет домены веб-сайтов зарегистрированые на номер телефона
• https://www.vedbex.com/tools/phone2skype — найдет аккаунт Skype
• https://aihitdata.com — найдет компании по всему миру где указан телефон, откройте вкладку “More Fields”
• https://sync.me — покажет имя из контактов и уровень спама
• https://leak-lookup.com/search — покажет на каких сайтах была утечка с искомым номером телефона
• https://play.google.com/store/apps/details?id=com.numbuster.android — Android приложение покажет как записан номер телефона в контактах
• https://revealname.com — выдаст имя владельца телефона, название операра связи
• https://Truecaller.com — покажет как записан номер телефона в контактах
• https://t.me/LeakCheckBot — покажет на каком сайте утёк телефон, бот принимает телефон только в виде цифр, без знаков плюс и т.п.
• https://t.me/getcontact_real_bot — покажет как записан номер телефона в контактной книжке
• https://whoseno.com — отобразит имя
• https://leakedsource.ru — покажет в каких базах замечен телефон, даст домен и дату утечки
• https://Intelx.io — найдёт упоминание номера телефона в утечках, даст имя файла и источника, вводите номер телефона во всех возможных форматах, с плюсом и без, с дефисом или скобками, и без них
• https://t.me/QuickOSINT_Robot — найдет оператора, email, адрес, как записан в контактах и многое другое, всего 3 бесплатных запроса для новых аккаунтов
• https://t.me/PhoneLeaks_bot — поиск в утечках, даст название источника слива
• https://t.me/n3fm4xw2rwbot — найдет возможные имена, адрес, email, телефоны, ВК, пароли, авто
• https://4wbwa6vcpvcr3vvf4qkhppgy56urmjcj2vagu2iqgp3z656xcmfdbiqd.onion.ws/ — найдет аккаунт Facebook в глобальной утечке, нужно пройти капчу перед поиском
• https://t.me/GetOK2bot — найдет профиль в Одноклассниках и даст ссылку на него
• https://t.me/OffThisContactBot — поиск в утечках, ищет как записан номер в контактах, аккаунты, адреса и прочее, для поиска подключите свой тг-бот, вводите телефон по разному, со скобками или без них и т.д
• https://seon.io — найдет аккаунты Skype, Viber, WhatsApp, Microsoft, проверит где зарегистрирован
• https://emobiletracker.com — выдаст имя владельца телефона
• https://t.me/safe_search_bot — в утечках находит адреса, телефоны почты
• https://x-ray.contact/ru-search — находит имена, логины, аккаунты, почты, фотографии, адреса и прочее, вход по IP адресу России запрещён, используй VPN
• https://t.me/t_sys_test_bot — найдет прописку, штрафы, авто, почты, дату рождения. документы, авиабилеты и прочее, бесплатный поиск 24 часа после первого запуска бота, вводите телефон только цифрами
• https://t.me/UniversalSearchRobot — находит город, первую букву улицы, номера дома или квартиры, аккаунты и прочее

Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х

12. Поиск по НОМЕРУ ТЕЛЕФОНА РОССИИ.
[!] Содержимое раздела:
# Здесь дополнение к пункту №11 #

• https://avclick.me/v/AVinfoBot – делает отчет где есть данные из социальных сетей, недвижимости, автомобилей, объявлений и телефонных книжек. Нужно пригласить другой аккаунт для отчета
• https://getcontact.com — выдает информацию о том как записан номер в контактах
• https://t.me/OffThisContactBot — поиск в утечках, ищет как записан номер в контактах, большая база контактов, бесплатно подключите свой бот
• https://truecaller.com — телефонная книга, ищет имя и оператора телефона
• https://spravnik.com — поиск по городскому номеру телефона, найдет ФИО и адрес
• https://m.ok.ru/dk?st.cmd=accountRecoverFeedbackForm — показывает часть номера телефона, email, фамилии и полностью город с датой регистрации, используй во вкладке инкогнито
• https://smartsearchbot.com — бот находит ФИО, email, объявления, бесплатный поиск не доступен для новых пользователей
• https://www.list-org.com/?search=phone — найдет организацию в РФ
• https://odyssey-search.info — сыщет ФИО, объявления Avito, автомобили, документы, места работы, контакты, а при регистрации можно указать любую российскую организацию
• https://find-org.com — найдет компанию в РФ
• https://data.intelx.io/saverudata/ — покажет, полный адрес, имя, все из сервиса Яндекс Еда, СДЕК, траты на еду за 6 месяцев, работает через VPN
• https://x-ray.contact/ru-search — в утечек найдет имя, аккаунты, адреса, почту, вход из России запрещён, нужен VPN
• https://bbro.su/searh_by_phone.aspx — найдет имя аккаунта на Авито и его объявления
• https://t.me/Getcontact_Officialbot — найдет как записан контакт, получает данные из приложения GetContact
• https://t.me/Zernerda_bot — ищет в двухсот слитых базах, находит адреса, имена, аккаунты и много другого, бесплатный поиск после первого запуска бота
• https://t.me/declassified_bot — найдет почту, имена, адреса, авто
• https://t.me/detectiva_robot — выдаст аккаунт ВК, ОК, адреса, почту, утечки
• https://t.me/data_surf_bot — ищет в утечках, выдает адреса имена, почты и прочее, одна бесплатная попытка на аккаунт

Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х

13. Поиск по НОМЕРУ ТЕЛЕФОНА УКРАИНЫ.
[!] Содержимое раздела:
# Здесь дополнение к пункту №11 #

• https://t.me/OTcIa6RB_InfoB_Bot — клон ИнфоБазы, бесплатно найдет полное имя или его часть
• https://t.me/OffThisContactBot — поиск в утечках, ищет как записан номер в контактах, большая база контактов, для поиска подключи свой тг-бот
• https://spravochnik109.link/ukraina — поиск по городскому номеру телефона, найдет ФИО и адрес
• https://t.me/people_base_bot — как и в боте uabaza дает информацио о паспорте только польностью, 3 бесплатные попытки
• https://www.searchyellowdirectory.com/reverse-phone/380/ — определит к какой области Украины принадлежит номер телефона
• https://m.ok.ru/dk?st.cmd=accountRecoverFeedbackForm — показывает часть номера телефона, email, фамилии и полностью город с датой регистрации, используй во вкладке инкогнито
• https://smartsearchbot.com — бот находит ФИО, email, объявления, бесплатный поиск не доступен для новых пользователей
• https://rol-x.ru/searh_by_phone.aspx — найдет объявления на OLX
• https://t.me/ce_poshuk_bot — даст ФИО, адрес, ИНН, другие номера телефонов
• https://t.me/olx_phone_bot — найдет объявления на OLX, при регистрации можно отправить любой контакт боту
• https://t.me/poiskorcombot — найдет досье, данные паспорта, адрес, фото и автомобили

Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х

14. Поиск по НОМЕРУ ТЕЛЕФОНА КАЗАХСТАНА.
[!] Содержимое раздела:
# Здесь дополнение к пункту №11 #

• https://truecaller.com — телефонная книга, найдет имя и оператора телефона
• https://fa-fa.kz/search_ip_too/ — найдет ФИО, проверка наличия задолженностей, ИП, и ограничения на выезд
• https://spravochnik109.link/kazahstan — поиск по городскому номеру телефона, найдет ФИО и адрес
• https://t.me/get_kolesa_bot — найдет объявления на колеса.кз
• https://m.ok.ru/dk?st.cmd=accountRecoverFeedbackForm — показывает часть номера телефона, email, фамилии и полностью город с датой регистрации, используй во вкладке инкогнито
• https://smartsearchbot.com — бот находит ФИО, email, объявления, бесплатный поиск не доступен для новых пользователей
• https://t.me/OffThisContactBot — поиск в утечках, ищет как записан номер в контактах, большая база контактов, бесплатно подключите свой бот
• https://t.me/Getcontact_Officialbot — найдет как записан контакт, получает данные из приложения GetContact

Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х

15. Поиск по ФИО.
[!] Содержимое раздела:

• https://aleph.occrp.org — поиск по базам данных, файлам, реестрам компаний, утечкам, и другим источникам
• https://www.locatefamily.com/ — найдет адрес
• https://infobel.com — найдет номер телефона, адрес и ФИО
• https://rocketreach.co — поиск людей в LinkedIn, Facebook и на других сайтах, находит email
• https://munscanner.com/dbs/ — поиск по реестрам компаний разных стран
• https://news-explorer.mybluemix.net — поиск в СМИ, найдет ассоциации между компаниями, публикациями и личностями
• https://sanctionssearch.ofac.treas.gov — поиск в санкционном списке США
• https://github.com/WhiteHatInspector/emailGuesser — подбирает на основе ФИ все возможные комбинации email адреса и верифицирует их
• https://billiongraves.ru — найдет когда умер и где захоронен
• https://www.findmypast.co.uk/search/historical-records?region=world&page=1&order_direction=desc&order_by=relevance — браки, смерти, рождения до 2006 года, нужно указать страну, нет стран СНГ
• https://webmii.com — упоминания в новостях, профили в социальных сетях, видео, можно добавить ключевое слово для точного результата
• https://aihitdata.com — найдет компании по всему миру где работает человек, откройте вкладку “More Fields” и введите ФИ в кавычках
• https://xlek.com — найдет какой домен был зарегистрирован на искомое ФИО, поиск в whois, покажет контакты и адреса
• https://my.mail.ru/my/search_people) (r) — даст аккаунт но Мой Мир, есть фильтры по возрасту, росту, весу, интересам и прочему
• https://leak-lookup.com/search — покажет на каких сайтах была утечка с искомым ФИО
• https://offshoreleaks.icij.org — найдет офшорные компании, адреса и их связи между собой, поиск по имени и фамилии на латинском
• https://app02.bazl.admin.ch/web/bazl/en/#/lfr/search — реестр Швейцарии, найдет зарегистрированные самолёты и вертолеты, используй расширенный поиск, имя только латиницей
• https://UsersBox.org — бот, найдет аккаунты, пароли, почты, имена, бесплатный период 14 дней для новых аккаунтов
• https://leakedsource.ru — покажет в каких базах замечено имя, даст домен и дату утечки
• https://opensanctions.org — найдет в списке санкций, даст дату рождения, должность, другое имя, членство в организациях, попробуй ввести имя латиницей
• https://seintpl.github.io/NAMINT/ — даст прямые ссылки на социальные сети и поисковики с разными вариантами имени, вводить ФИО только на латинице
• https://t.me/OffThisContactBot — найдет номер телефона, ищет в именах глобальной телефонной книги, бесплатно подключите свой бот
• https://www.archivesportaleurope.net/search/-/s/n — найдет упоминание в национальных архивах стран Европы, можно найти в списках работодателей, учебных учреждений, военных архивах и в многих других архивах
• https://4wbwa6vcpvcr3vvf4qkhppgy56urmjcj2vagu2iqgp3z656xcmfdbiqd.onion.ws/ — найдет номер телефона, ID аккаунта Facebook, работу, в глобальной утечке Facebook, нужно пройти капчу перед поиском
• https://t.me/t_sys_test_bot — найдет прописку, штрафы, авто, почты, дату рождения. документы, авиабилеты и прочее, бесплатный поиск 24 часа после первого запуска бота, можно указать только часть даты рождения

Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х

16. Поиск по ФИО РОССИИ.
[!] Содержимое раздела:
# Здесь дополнение к пункту №15 #

• https://t.me/egrul_bot — найдет ИП и компании
• https://www.reestr-zalogov.ru/search/index — поиск в реестре залогодателей, даст паспортные данные, место и дату рождения и т.д.
• https://zytely.rosfirm.info/m/ — найдет адрес прописки и дату рождения, необходимо знать город
• https://mmnt.ru — найдет упоминания в документах
• https://kad.arbitr.ru — найдет дела арбитражных судов
• https://bankrot.fedresurs.ru — поиск в реестре банкротов, можно узнать ИНН, СНИЛС и адрес
• https://spra.vkaru.net — телефонный справочник по России, Украине, Белоруссии, Казахстану, Литве и Молдове
• https://fssprus.ru/iss/ip/ — проверка задолженностей, для физ. лица
• https://www.reestr-dover.ru/revocations — поиск в списке сведений об отмене доверенности
• https://data.notariat.ru/directory/succession/search?last_name=%D0%BF%D0%B5%D1%82%D1%80%D0%B5%D0%BD%D0%BA%D0%BE&first_name=&middle_name=# — поиск в реестре наследственных дел, найдет дату смерти человека и адрес нотариуса оформившее дело
• https://глазбога.com — обратный поиск в GetContact, находит часть номера телефона
• https://service.nalog.ru/inn.do — найдет ИНН, необходимо указать дату рождения и паспортные данные, дату выдачи не обязательно верно
• https://go.mail.ru/msocial — ищет аккаунты в VK, OK и Facebook
• https://bigbookname.com/search# — находит древние данные профилей ВК, есть фильтры по дате рождения, по стране и городу
• https://notariat.ru/ru-ru/help/probate-cases/ — если человек умер, то найдет дату смерти, номер наследственного дела, где оно было открыто и каким нотариусом 
• https://wordstat.yandex.ru — покажет что ищут вместе с ФИ или ФИО в Яндексе
• https://news.myseldon.com — находит упоминания в российских СМИ, строит дерево связей между медийными объектами, которое образуются на основе их совместного упоминания в тексте новости
• https://spravnik.com — найдет номер телефона, адрес регистрации, необходимо знать город, через VPN
• https://www.list-org.com/?search=boss — найдет организацию в учредителях и руководителях
• https://www.list-org.com/?search=fio — найдет предпринимателя, его гос закупки, дерево связей
• https://odyssey-search.info — персональные данные гражданина России, автомобили, документы, адрес проживания, скоринг негатива, агрессивность, посягательство на жизнь и свободу, преступления, наркотики и т.п., зарегистрироваться можно на имя любой существующий компании
• https://elections.istra-da.ru — реестр кандидатов на выборы, есть более миллиона человек, найдет судимости, дату рождения, место жительства и работы, должность, образование и прочее
• https://contragent.integrum.ru/ul/Navigator.aspx — поиск в ИП, руководителях компаний, и персонах, построит граф связей между компаниями, учредителями, историческими связями, адресом, арбитражными делами, акционерами, владельцами и прочего
• https://contragent.integrum.ru/search/ — найдет ФИО в руководителях, учредителях, акционерах, ИП
• https://data.intelx.io/saverudata/ — покажет, полный адрес, телефон, почту, имя, все из сервиса Яндекс Еда, СДЕК, иногда работает через VPN, вводи фамилию и листай результаты
• https://ts.domspravka.com/ — найдет адрес регистрации, нужно указывать город
• https://t.me/Zernerda_bot — ищет в двухсот слитых базах, находит адреса, имена, аккаунты и много другого, бесплатный поиск после первого запуска бота
• https://t.me/safe_search_bot — в утечках находит адреса, телефоны, почты
• https://declarator.org — реестр должностных лиц, покажет доходы, штук авто, площадь и количество недвижимости, должность и место работы
• https://rupep.org — реест публичных деятелей, найдет инн, дату рождения, место рождения, историю карьеры, декларации, авто, площадь недвижимости, связанные юр. лица
• https://t.me/declassified_bot — ищет в утечках, найдет паспорт, адрес регистрации, полис, дату рождения, номер телефона, почту и прочее
• https://t.me/data_surf_bot — ищет в утечках, выдает адреса имена, почты и прочее, одна бесплатная попытка на аккаунт
• https://www.gosuslugi.ru/api/posobie16/v1/orders/snils/lookup?lastName=ФАМИЛИЯ&firstName=ИМЯ&middleName=ОТЧЕСТВО&birthDate=ГГГГ-ММ-ДД — найдет СНИЛС гражданина до 18 лет, нужно знать дату рождения, замените ГГГГ-ММ-ДД на дату рождения, и Имя, Фамилия, Отчество в ссылке
• https://sudrf.kodeks.ru/rospravo — есть фильтры по дате, виду документа, всего у сайта более 57М судебных актов
• https://xn--90afdbaav0bd1afy6eub5d.xn--p1ai/search — есть фильтры по дате, виду документа, федеральному округу
• https://rospraa4xvtuscgl357uxizzvhgpjetxnri4gi5qzggvmaoeu6witiid.onion.ws/ — есть фильтры по дате, всего у сайта более 140М судебных актов
• https://sudact.ru — фильтры по дате, разделу, ФИО судьи, номеру дела

Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х

17. Поиск по ФИО КАЗАХСТАНА.
[!] Содержимое раздела:
# Здесь дополнение к пункту №15 #

• https://mmnt.ru — найдет упоминания в документах
• https://spra.vkaru.net — телефонный справочник
• https://zytely.rosfirm.info — найдет адрес прописки и дату рождения
• https://fa-fa.kz/search_ip_too/) — проверка наличия задолженностей, ИП, и ограничения на выезд
• https://t.me/ShtrafKZBot — найдет ИНН, дату рождения и много других данных
• https://kgd.gov.kz/ru/services/taxpayer_search_unreliable — поиск в базе неблагонадежных налогоплательщиков, найдет ИНН/БИН и РНН
• https://глазбога.com — обратный поиск по GetContact, находит часть номера телефона
• https://bigbookname.com/search#/ — находит древние данные профилей ВК, есть фильтры по дате рождения, по стране и городу
• https://adata.kz — выдаст ИНН в URL, дату рождения предпринимателя

Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х

18. Поиск по ФИО УКРАИНЫ.
[!] Содержимое раздела:
# Здесь дополнение к пункту №15 #

• https://erb.minjust.gov.ua/#/search-debtors — реестр должников, дату рождения, связь с исполнителем, номер ВП, категорию взыскания
• https://usr.minjust.gov.ua/content/free-search — находит место жительства
• https://mmnt.ru — найдет упоминания в документах
• https://spra.vkaru.net — телефонный справочник
• https://court.opendatabot.ua/#/ — поиск в судебных решениях
• https://глазбога.com — обратный поиск по GetContact, находит часть номера телефона, зарегистрированные организации, авто
• https://bigbookname.com/search#/ — находит древние данные профилей ВК, есть фильтры по дате рождения, по стране и городу
• https://dolg.xyz — находит связанные лица и государственные органы
• https://spravnik.com — найдет номер телефона, адрес регистрации, необходимо знать город
• https://ripsearch.youmust.click/ua/search.html — поиск захороненных в Киеве, найдет дату рождения и смерти
• https://t.me/OTcIa6RB_InfoB_Bot — клон ИнфоБазы, бесплатно найдет часть номера телефона и прочее
• https://drrp.app/search — найдёт адрес проживания
• https://odyssey-search.info — персональные данные гражданина Украины, автомобили, документы, адрес проживания, зарегистрироваться можно на имя любой компании
• https://t.me/ce_poshuk_bot — найдёт ФИО, адреса регистрации, дату рождения и прочее
• https://t.me/poiskorcombot — найдет досье, данные паспорта, адрес, фото и автомобили, для уточнения укажите дату рождения
• https://t.me/OpenDataUABot — найдет собственность, компании, ФЛП, розыск, обязанности, долги, судебные иски

Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х

19. Поиск по IMEI.
[!] Содержимое раздела:

• http://checkmi.info/ - показывает страну регистрации Mi-аккаунта, часть номера телефона для восстановления и часть email-адреса
• https://www.imei.info/ - характеристики устройства
• https://www.imeipro.info/check_imei_iphone.html - определит iPhone, его модель, статус активации, технической поддержки, гарантии, статус iCloud, право на участие в программе AppleCare и покрытие
• https://t.me/QuickOSINT_Robot - найдёт фотоизображение телефона, модель, тип устройства, операционную систему, страндарты, частоты и прочие характеристики, всего 3 беслплатных запроса для новых аккаунтов

Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х

20. Поиск по СЕРИЙНОМУ НОМЕРУ.
[!] Содержимое раздела:

• https://warrantycheck.epson.eu — техника бренда Epson, даст номер модели, номер материала
• https://dysonseriallookup.com/BedBathBeyond — техника бренда Dyson, даст дату поставки и продавца
• https://wwwp.medtronic.com/productperformance/serialLookup.html?serialNumber — техника бренда Medtronic, выдает модель и тип медицинского оборудования
• https://www.bobswatches.com/rolex-serial-numbers — по серийному номеру часов Rolex выдает год производства
• https://pcsupport.lenovo.com/us/en/warrantylookup#/ — техника бренда Lenovo, выдает модель, а если залогиниться то и информацию о гарантии
• https://www.imei.info/apple-sn-check/ — техника бренда Apple, выдет модель, цвет, объем накопителя, время изготовления, место производства
• https://www.vega.com/en/products/serialnumber-search — техника бренда Vega, различные датчики и системы контроля систем водоснабжения, отопления и прочего связанного с ЖКХ, даст подробную информацию о модели, дате поставки и дате тестирования

Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х

21. Поиск по WI-FI.
[!] Содержимое раздела:

• (SSID) http://wigle.net/search — находит Wi-Fi точку, ее физический адрес и BSSID
• (BSSID) https://xinit.ru/wifi/ — покажет местоположение Wi-Fi
• (BSSID) https://alexell.ru/network/mac-geo/ — тоже покажет местоположение
• (BSSID) http://wigle.net/search — находит Wi-Fi точку, ее физический адрес и название

Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х

22. Поиск по ФОТОГРАФИИ.
[!] Содержимое раздела:

• https://search4faces.com — найдет профиль VK, OK, TikTok и Clubhouse, не точен
• https://smartsearchbot.com — бот находит страницу в ВК, бесплатный поиск не доступен для новых пользователей
• https://vk.watch — находит аккаунты ВКонтакте с похожими лицами, не точен, дождитесь загрузки фото
• https://odyssey-search.info — найдет аккаунт ВК и ОК, при регистрации можно указать любую российскую организацию, но ваш email чтобы получить логин и пароль 
• https://pimeyes.com — показывает фото с похожими лицами и клонов, иногда сайт работает только через VPN
• https://t.me/pimeyesbot — найдет фото с лицом во всем интернете, результат приходит в течении 10 минут
• https://t.me/findmekz_bot — найдет фото из ВК, регистрация возможна только пользователем с номером телефона Казахстана
• https://t.me/PinFaceBot — найдет аккаунт ВК, средняя точность поиска
• https://t.me/findfacerobot — найдет аватар с искомым лицом в ВК, Инстаграм, Clubhouse, Tiktok и OK ru
• https://t.me/facematch_bot — найдет фото с таким же лицом взятых из сайтов Казахстана
• https://camgirlfinder.net/search — найдет веб-кам моделей, их ник и профиль
• https://facecheck.id — сыщет лицо в социальных сетях, дает ссылку на источники, среднее качество распознавания лица
• https://www.faceplusplus.com/face-comparing/ — сравнит два лица и покажет уровень схожести, открывать в версии для ПК
• https://play.google.com/store/apps/details?id=tk.silviomarano.imageanalysistoolset — сравнит два лица и покажет уровень схожести, в приложении раздел Face insight, после пункт compare в списке
• https://mxface.ai/face-comparing#Face_Detection_demo_section — сравнит два лица и покажет уровень схожести
• https://t.me/DeepPaintBot — повышает качество фото лица
• https://huggingface.co/spaces/sczhou/CodeFormer — улучшает фото с лицом
• https://app.remini.ai — сделает фото лица четче
• https://metapicz.com — покажет EXIF
• https://stolencamerafinder.com — определит EXIF и по этим данным найдет какие еще фото были сделаны этим устройством
• https://exif.regex.info — извлекает META-данные
• https://t.me/mediainforobot — извлекает EXIF
• https://29a.ch/photo-forensics/#level-sweep —  фото-форензика, анализ изображения на изменения
• https://stylesuxx.github.io/steganography/ — декодирует скрытое сообщение в изображении
• https://github.com/beurtschipper/Depix — депикселизирует текст на картинке
• https://focusmagic.com — восстановит детали и резкость размытых фотографий
• https://forensicdots.de — ищет на скане документа желтые точки являющиеся уникальным идентификатором принтера
• https://www.diffchecker.com/image-diff/ — помогает найти различия двух картинок
• https://compress-or-die.com/analyze-process — показывает ICC_Profile, в нем можно по скриншоту на Mac узнать дату последнего обновления системы, есть exif и таблица квантования яркости
• https://exiftool.org — программа для чтения, записи и редактирования метаинформации, определит производителя многих цифровых камер
• https://github.com/ianare/exif-py — выгружает метаданные из большого объёма изображений 
• https://t.me/UniversalSearchRobot — обратный поиск по фото, даст прямые ссылки на 6 поисковиков

Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х

23. Поиск по IP-АДРЕСУ.
[!] Содержимое раздела:

• https://github.com/SpiderLabs/HostHunter — обнаружение и извлечение имен хостов из набора целевых IP-адресов
• https://censys.io — находит какие серверы и устройства выставлены в сети
• https://github.com/cyberhubarchive/archive — архив утекших данных, в нем есть IP адреса аккаунтов Skype
• https://spiderfoot.net — автоматический поиск с использованием огромного количества методов, нужно использовать в облаке если пройти регистрацию
• https://iknowwhatyoudownload.com/ — покажет что скачивают в интернете
• https://check.torproject.org/cgi-bin/TorBulkExitList.py — найдет список всех выходных узлов Tor за последние 16 часов, которые мог связаться с IP
• https://dnslytics.com/reverse-ip — найдет домены
• https://metrics.torproject.org/exonerator.html — проверяет использовался ли IP-адрес в качестве узла для передачи трафика в Tor, требуется указать дату
• https://talosintelligence.com — покажет сколько писем было отправлено с адреса и его репутацию
• https://intelx.io — найдет упоминание в файлах из утечек
• https://t.me/UniversalSearchRobot — даст прямые ссылки на 20+ ресурсов где можно найти историю Whois, домены, адрес и еще 20+ видов данных
• https://ru.wikipedia.org/wiki/%D0%A1%D0%BB%D1%83%D0%B6%D0%B5%D0%B1%D0%BD%D0%B0%D1%8F:%D0%96%D1%83%D1%80%D0%BD%D0%B0%D0%BB%D1%8B?type=&user=&page=%D0%A3%D1%87%D0%B0%D1%81%D1%82%D0%BD%D0%B8%D0%BA%3A1.1.1.1&wpdate=&tagfilter=&wpfilters%5B%5D=newusers — поиск в журнале правок, банов, регистрации участников wikipedia, замените 1.1.1.1 в поле цель
• https://leak-lookup.com/search — покажет на каких сайтах была утечка искомым IP
• https://xjypo5vzgmo7jca6b322dnqbsdnp3amd24ybx26x5nxbusccjkm4pwid.onion.ws/deepsearch —  найдет логин, пароль, источник утечки
• https://leakedsource.ru — покажет в каких базах замечен IP адрес, даст домен и дату утечки
• https://t.me/Zernerda_bot — ищет упоминание в слитых базах, находит аккаунты, почты, адреса и прочее, бесплатный поиск после первого запуска бота

Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х-Х

24. Поиск по ФИЗИЧЕСКОМУ АДРЕСУ.
[!] Содержимое раздела:

• https://3wifi.stascorp.com/map — найдет wifi точки с паролями
• https://github.com/woj-ciech/kamerka — найдет на карте камеры, устройства интернета вещей, принтеры, твитты, Instagram фото, Flickr и другие открытые устройства
• https://wigle.net — покажет SSID и BSSID Wi-Fi точки
• https://osintcombine.com — найдет Facebook страницы организаций
• https://trendsmap.com — карта трендов в Twitter
• https://www.omnisci.com/demos/tweetmap/ — покажет твитты на карте
• https://mattw.io/youtube-geofind/location — находит видео на YouTube
• https://windy.com — множество камер с функцией поиска по истории, есть карта
• https://opencellid.org — вышки сотовой связи, найдет MCC, MNC, LAC, CID
• https://www.strava.com/heatmap — сайт показывает где бегают спортсмены
• https://map.snapchat.com — найдет недавние видео из Snapchat
• https://www.doogal.co.uk/strava.php — данные из Strava, показывает имена пользователей
• https://www.udeuschle.de/panoramas/makepanoramas_en.htm — составит панораму гор
• https://whopostedwhat.com — находит фото в Instagram с фильтром по дате
• https://onemilliontweetmap.com — покажет твиты за последние сутки на карте
• https://github.com/sc1341/SnapMap-OSINT — скачает все фото и видео из Snapchat в указанном на карте радиусе
• https://github.com/jkctech/Telegram-Trilateration — показывает точное местоположение пользователей Telegram включивших функцию "люди рядом"
• https://www.flickr.com/map — найдет снимки пользователей на карте, выберите место поиска, нажмите "search the map" а потом "go"
• https://pastvu.com — исторические снимки места с 1826 по 2000 годы
• https://photo-map.ru — найдет фото из VK, радиус поиска от 10 метров
• https://app.skylens.io — найдет на карте фото Instagram, YouTube видео, твиты, фото из ВК, минимальный радиус поиска 1 км.
• https://openaltimetry.org/data/icesat2/ — показывает точный рельеф, подберите дату чтобы полоса точек попала на нужное место, выделите область "select region" и сервис даст точки отображающие выбранный рельеф
• https://demo.f4map.com — покажет здания любого города в 3D, данные из OpenStreetMap
• https://ГлазБога.com — найдет пользователей VK и фото на карте
• https://github.com/tejado/telegram-nearby-map — показывает точное местоположение пользователей Telegram включивших функцию "люди рядом", их имена и фото аккаунта
• https://t.me/UniversalSearchRobot — даст прямые ссылки на 10 карт где есть спутниковые снимки, погода, таймлапс, исторические спутниковые снимки и прочее
• https://domofoto.ru/map.php — найдет фото зданий, их серию и номер, больше снимков в России и Украине
• https://live.sixfold.com — покажет состояние нагрузки границ стран Европы, покажет пропускные пункты суши, воды и уровень нагрузки
• https://birdhunt.co — найдет твитты рядом, создаст ссылку на Twitter, где введен поисковый запрос с координатами и заданным радиусом
• https://instahunt.co — отобразит фото из Instagram, скопируй полученный код и встать в поле на сайте чтобы увидеть результат
• https://t.me/QuickOSINT_Robot — найдет на карте пользователей Telegram, всего 3 бесплатных запроса для новых аккаунтов
• https://etomesto.ru — найдет исторические топографические карты, укажите точку на карте и найдется нужная старая карта
• https://wikimapia.org — спутниковые снимки Google, Yandex, Bing и Yahoo, есть фильтр зданий по году постройки, по категориям, обозначение объектов которых нету на других картах
• https://livingatlas.arcgis.com/wayback/ — покажет исторические снимки
• https://satellites.pro — есть карты Apple, MapBox, Yandex, Esri и Google
• https://apps.sentinel-hub.com/eo-browser/ — база почти ежедневных снимков со спутника, можно делать таймлапс
• https://zoom.earth — есть высококачественные изображения для этого выберите базовую карту, есть пожары, штормы, ветер и история этих данных по дате
• https://orbtwz.users.earthengine.app/view/csar-eye — найдет и отметит изменения на спутниковых снимках в указанную дату
• https://imagehunter.apollomapping.com — 64 датасета, фильтры по дате, качеству снимков, чтобы получить снимки выдели на карте область
• https://retromap.ru/closeby.php — найдет исторические, топографические карты и спутниковые снимки с 12 века по настоящее время
• https://map.openaerialmap.org — фото с дрона, ультравысокое качество картинки, до 3 см на пиксель, небольшое покрытие, использовать на ПК
• https://windy.com — есть история записей
• https://world-cam.ru/world/ — камеры в реальном времени 
• https://cipher387.github.io/webcamcse/ — по названию местности найдёт камеры в реальном времени, ищет среди 10 сайтов с трансляциями
• https://vesselfinder.com — покажет все судна на карте
• https://globe.adsbexchange.com — самолеты и вертолеты с историей передвижений
• https://www.google.com/maps/ — просмотр в 360 градусов почти во все странах
• https://www.mapillary.com/app/ — данные загружаются пользователями, не всегда есть обзор в 360 градусов
• https://kartaview.org/map — данные загружаются пользователями, нету панорам
• https://railcabrides.com/en/mapsearch — видео из кабины поезда, нет крупных городов
• https://360cities.net/map — панорамы

''')